{
    "place_name": "Seoul Food Meat Company | South End",
    "place_id": "ChIJU8QmLn6fVogRee93hyd3aCg",
    "place_description": "A rustic hangout for Korean-inspired BBQ eats paired with Asian craft beers & custom cocktails.",
    "place_rating": 4.3,
    "place_total_reviews": 3285,
    "place_google_id": "0x88569f7e2e26c453:0x286877278777ef79",
    "place_reviews_id": "2911708170755239801",
    "place_reviews_link": "https://search.google.com/local/reviews?placeid=ChIJU8QmLn6fVogRee93hyd3aCg&authuser=0&hl=en&gl=UA",
    "reviews_data": [
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzdmFLcUZREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUQzdmFLcUZREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID3vaKqFQ%7CCgwI5LvquQYQyJ6Y6QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1731894756,
            "review_datetime_utc": "11/18/2024 01:52:36",
            "review_text": "Great service from both Jada & Kea!  The atmosphere was very comfortable and pleasant! We enjoyed the bowel bun sliders, smoked beef, brisket, sweet potato, Bertsnest, bowel bun sliders, pork belly, and bowel bun sliders fried fish!\n\nYou have to try the sweet tea. It's amazing."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzMXNyS0hBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUQzMXNyS0hBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID31srKHA%7CCgwIsOfZuQYQkKrrgQM%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1731621808,
            "review_datetime_utc": "11/14/2024 22:03:28",
            "review_text": "The food was really good, we went late at 10pm and they were playing loud DJ music. Which I liked the music itself just didn't feel like it fit the vibe of the restaurant"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQzeXZXY2dBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQzeXZXY2dBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID3yvWcgAE%7CCgwIz8_VuQYQgJmthAI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1731553231,
            "review_datetime_utc": "11/14/2024 03:00:31",
            "review_text": "Ondraya and the entire team are always helpful every time I and my friends come here. We will continue to come to this Seoul Food it's a staple. The food and drinks are always done right and we enjoy talking to all the workers"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQzeXRYbEZnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUQzeXRYbEZnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID3ytXlFg%7CCgsI787VuQYQoO_6Bg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1731553135,
            "review_datetime_utc": "11/14/2024 02:58:55",
            "review_text": "Ondraya and Sophie were great!!! Service was phenomenal. Would definitely be a regular here."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNRdVppcjFnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNRdVppcjFnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICQuZir1gE%7CCgsIp_LEuQYQ8O_ZZg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1731279143,
            "review_datetime_utc": "11/10/2024 22:52:23",
            "review_text": "Amazing. Definitely try the Kimchi Fries and hot wings. Wonderful unique food and great service in an open chic decor, albeit a bit noisy. Perfect spot for late eats or a fun night with friends and family."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzMzlPWDFBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUMzMzlPWDFBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC339OX1AE%7CCgsI8_bDuQYQ0N3gfg%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1731263347,
            "review_datetime_utc": "11/10/2024 18:29:07",
            "review_text": "Smoked brisket was some of the driest meat I've had in my life - maybe the fried chicken is better. Cornbread was so dense almost inedible.  Really disappointed because the concept is great and the flavors too, but execution is just not there."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuLU1ITkhBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNuLU1ITkhBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICn-MHNHA%7CCgwIgeK0uQYQgNCq7gI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1731014913,
            "review_datetime_utc": "11/07/2024 21:28:33",
            "review_text": "Horrible experience. Craziest part is that is wasn't even the the bartender or the cooks... it was surprisingly the MANAGER of this location. We ordered about $100 worth of food and drinks unfortunately one of the drinks we had my partner was allergic to and the bartender decided to offer a different drink. The MANAGER shortly after decided to hound out the bartender about the drink in front of us. That alone made us feel super uncomfortable to enjoy our food. I still decided to continue to eat my food. My wings were very very dry and I had asked the cooks for more sauce in which there was ton of communication between them as if they have been ordered to not offer more wing sauce because of cost. I then asked for one of their pre packaged sauces in which they had to discuss further before the trying to provide me with packed ketchup because that indeed was the cheapest sauce they had. I wouldn't have mind paying the difference. This was at their church street location.\n\nTHE MANAGER the decided to walk up and approach me behind my back. He then tried to make it seem as if there was a problem for asking for sauce. I informed him with consideration of paying close to $100 I didn't understand why asking for honestly anything that night was a problem. He then went on to say he didn't have to get sauce and that I could leave which was before we could even eat our food. I then asked for a refund because we couldn't eat our food in which he RAISED his voice to say no and that I'd have no luck even if I tried to dispute with the transaction. He then walked away into his office and slammed the door on us in front of ALL the staff and the customers that were there.\n\nIn conclusion, he was pissed because I guess he felt they lost a total of $3.25 that night for remaking the drink and the providing a sauce when instead he now has lost $100 in total because of his horrible hospitality that didn't exist and horrible customer service. Imagine telling your employees to penny nickle and dime with the 10 customers they had come in that night and now he himself has lost the company $100.\n\nHe never walked up to even ask if we were having a good experience in which that alone I would probably came back 3 more times after meaning they could've made $400 of me.\n\nGood luck explaining to the owners how now you they're -$100 and you're losing more money than the employees here he suppose to manage and report to him.\n\nUNACCEPTABLE. UNPROFESSIONAL. IRATE. DEMEANING. CHEAPSKATE. = Manager"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzcXZqbEN3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMzcXZqbEN3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC3qvjlCw%7CCgsI8uSjuQYQsOj5cQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1730736754,
            "review_datetime_utc": "11/04/2024 16:12:34",
            "review_text": "I went to Seoul Food Meat Company after reading the reviews and it seemed like a decent restaurant with many reviews but I made the mistake of not reading the latest reviews and that's where I got got! When I walked into Seoul Food Meat Company, the restaurant was entirely empty except for the bar tender and a person who seemed to be the owner. He didn't necessarily greet me but more so gave me the menus and told me and my family that we could sit wherever. OKay!\n\nTo be fully transparent, I had my mind set on going to Ruby Sunshine which is right across the street and I truly should've followed my intuitions but I didn't. So back to Seoul Food, the menus is simple, straightforward the food items seemed to be good. We placed our orders with the bartender who seemed to not truly care about us or our order. It was difficult to understand her, not due to language barrier but because she talked so low and the restaurant is empty.\n\nWhen we got out food, I can say I was disappointed with the taste, the presentation and the temperature of the food. I read Saniqua P's review that said \"I feel like Seoul is that person you knew in school who so desperately wanted to be part of the \"cool\" crowd but their efforts always felt a tad forced.\" I definitely felt that and it's true. Seoul Food to me is trying to fit into a segment that doesn't fit them or vice versa and it shows.\n\nWith the lack of customer service, the slow service, and the food being disappointing, I have learned and will not be coming back, but since the business doesn't read the comments, I know it doesn't matter anyway! I recommend you try another place that is true to the cuisine and appreciates the customers."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMzLUxmdklREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMzLUxmdklREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC3-LfvIQ%7CCgwIsfKZuQYQ-KTLmwM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1730574641,
            "review_datetime_utc": "11/02/2024 19:10:41",
            "review_text": "This is not an authentic Korean food experience. The food was ok but if you are looking for a Korean food experience this is not the place. You order your food at the bar and there are not many Korean food options. The food is served on a cookie tray type of pan. It is more of a college bar business."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMzZ05hTWpnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUMzZ05hTWpnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC3gNaMjgE%7CCgwIoo2UuQYQ4PGQrQE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1730479778,
            "review_datetime_utc": "11/01/2024 16:49:38",
            "review_text": "Ended up here last minute, unplanned and it is so unfortunate to not see this place packed with people. They have tons of space, a great selection of Korean comfort food, and drinks. We had the sweet and spicy chicken wings and they were one of the best wings I've ever had. I will definitely come back to try more of their stuff."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYaWFfajV3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURYaWFfajV3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDXia_j5wE%7CCgwInc7_uAYQuPP1rQE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1730144029,
            "review_datetime_utc": "10/28/2024 19:33:49",
            "review_text": "I got the fire chicken and it's the most bland chicken i've ever tried. It looks like they just took a chicken breast put some cheese and blowtorched it and I had to throw it up because it tasted so bad. They also gave a small amount of the sauce which was also horrible. The potato salad side was also atrocious it was incredibly bland as well. I would strongly avoid this place as it literally made me sick."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYX3JHcjd3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURYX3JHcjd3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDX_rGr7wE%7CCgwIt_z6uAYQkOTQzAI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1730068023,
            "review_datetime_utc": "10/27/2024 22:27:03",
            "review_text": "We've loved coming here since it opened but in the past 6 months, it's gone way down. Our chicken wasn't thoroughly cooked and when we asked what kind of oil is used to fry it (one of our party members has an allergy), neither the manager or one of the kitchen workers could give us an answer."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYN3RtVktREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURYN3RtVktREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDX7tmVKQ%7CCgwI4af5uAYQwLrXlQI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1730040801,
            "review_datetime_utc": "10/27/2024 14:53:21",
            "review_text": "The food is not as good as it used to be. Also if you are dining in you must pay before you get your food."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYMXJQRklBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURYMXJQRklBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDX1rPFIA%7CCgwIleL2uAYQ4I7Z8AI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1729999125,
            "review_datetime_utc": "10/27/2024 03:18:45",
            "review_text": "Butterbeer enough said.\n\nJk Alex and Leo are amazing bartenders and kept us well hydrated all night. We had the K-pop room for my friends iconic birthday and we couldn't have asked for better people to take care of us all night it was such a good vibe and the DJ kept playing bangers. The food here is bussing and you should definitely try it. We had so much fun."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURYbXFLNEdBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURYbXFLNEdBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDXmqK4GA%7CCgwI3q7yuAYQsI_UnQM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1729927006,
            "review_datetime_utc": "10/26/2024 07:16:46",
            "review_text": "Paid a reservation fee of $20 for a karaoke room. When we got to the place, we were told that all reservations were cancelled for that night, but they mistakenly forgot to disable our time slot from being able to make the reservation. This made our $20 reservation invalid. They then told us that we could still rent a room if we wanted. So if you see our reservation and you have rooms open, why was it such a hassle to fulfill our reservation? On top of that, when we rented the room, you charged us an additional $30 for the time. The total cost should have been $45, and somehow, because of your mistakes, we had to pay $50? It's not the money, it's the principle. The mistake was on your end, but we some how end up paying more. Then, the kitchen is closed because of a party; prioritizing other guests. Your business' actions show a lack of transparency, management and the fact you all tried to avoid the conversation of refund or compensation, for a mistake made by the business, demonstrates dishonesty or incompetency. Either way, it's a disaster. Do better."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURYc3YtbzNRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURYc3YtbzNRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDXsv-o3QE%7CCgwIl4rwuAYQ-Lfy_gI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1729889559,
            "review_datetime_utc": "10/25/2024 20:52:39",
            "review_text": "It's definitely changed.... No more Korean music, um ok, but Jamaican music? I expect that in my fav Jamaican restaurants. There's no reason to not play Korean music especially with so many collabs and English songs now. Moving on... great variety on soju flavors. Menu options remain unique and varied. I love the fusion between Korean and Southern food. Haven't moved out of town, I was so excited to visit. I am hoping this was an off day. The flavor of 3 out of 4 dishes was muted. It just wasn't good. The fried chicken had great soy garlic flavor, but was not fully cooked. Management took care of it and brought me a new batch. Perfect. One money of the party had an allergy. The manger couldn't answer what oil was used to fry the chicken. He didn't attempt to find out. I suppose the risk of anaphylactic shock was acceptable. I had to get up and ask one of the kitchen staff myself. I think they need actual Korean cooks in the kitchen and a little training about dangerous food allergies. I'm sorry to even be writing this review."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYODVhdDR3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNYODVhdDR3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICX85at4wE%7CCgwI8MnTuAYQ8NSlngM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1729422576,
            "review_datetime_utc": "10/20/2024 11:09:36",
            "review_text": "The food is amazing and the new brand of soju is really good. I miss the days when there was kpop MVs playing on the TV."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYaGJfeWZ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNYaGJfeWZ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICXhb_yfw%7CCgwI2YrKuAYQwNe5gAI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1729267033,
            "review_datetime_utc": "10/18/2024 15:57:13",
            "review_text": "One of the workers gave us menus but didn't tell us that we had to order our food and drinks at the bar. We spent 15 minutes waiting. Also seemed like no one wanted to work there. The only good thing about this place was the food. Would not go back"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNYN0pHYnlnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNYN0pHYnlnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICX7JGbygE%7CCgwIwYuyuAYQsIj5zwE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1728873921,
            "review_datetime_utc": "10/14/2024 02:45:21",
            "review_text": "I rented a karaoke room here for me and my friends and have a mixed review.\n\nPros: cool concept to have private, themed karaoke rooms. Drinks and food were good. DJ in the main restaurant was great and we had fun dancing. Service was decent.\n\nCons: the main TV for my karaoke room was broken and the staff couldn't get it to work. The karaoke control system was super frustrating to use (huge remote, Korean letters, laborious clicking of buttons) and half the songs just cut off in the middle. The layout of my K-Pop-themed room was awkward with long benches and narrow space for people. If you're vegetarian, none of the entrees were able to be made veggie. They do have a yummy appetizer dish made with tofu but that was it.\n\nOverall, we had fun but I couldn't honestly recommend doing what we did bc of the issues I mentioned. They did discount some of our bill bc of the TV so that was nice."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYMUl1dmF3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNYMUl1dmF3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICX1Iuvaw%7CCgsI2-evuAYQuJeIJw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1728836571,
            "review_datetime_utc": "10/13/2024 16:22:51",
            "review_text": "We attended a birthday party at Seoul Food last night in a private room. The equipment didn't work, but no solution was offered. The karaoke system was outdated and songs kept cutting off. The service was lacking. It took 30 minutes for every round of (weak) drinks. The server never cleared the tables and was MIA most of the night. The business lost lots of money from our crowd due to slow and apathetic service. The only redeeming quality was the people we were with for the celebration."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNYNUwtdFZ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNYNUwtdFZ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICX5L-tVw%7CCgsI_qOvuAYQoP_ZKw%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1728827902,
            "review_datetime_utc": "10/13/2024 13:58:22",
            "review_text": "My friend rented a karaoke room for her birthday party.  One of the tvs in the room didnt work and the staff couldn't figure out how to turn it on.  We had about 18 people in the room and they did not attend to us very well at all.  They didnt bus our tables so trays of food piled up all night...we had to request for them to be removed.  Our server barely checked in on us and drinks were very slow to get to us.  Many of us had to leave the room to order drinks from the bar and even then, drinks were very slow to get to us.  Although we still managed to have a good time we were all very disappointed with the customer service here.  The food was not to bad, I enjoyed it but others in our party did not.  We will probably not return."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURuM19XNGJ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURuM19XNGJ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDn3_W4bw%7CCgwIu9emuAYQ0Pzl5QI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1728687035,
            "review_datetime_utc": "10/11/2024 22:50:35",
            "review_text": "My husband and I was excited to have lunch at Seoul BBQ today for lunch, for the first time. It was self seating. We grabbed our menus, sat down. There was 2 people at the bar and just us in general seating. One service person passed us twice with not even a hello. The other service person in the back just looked at his phone, not even lifting his head to acknowledge our existence. We waited for a while, then we just got up and left. Terrible customer service."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURucDU2aERREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURucDU2aERREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDnp56hDQ%7CCgsIi82huAYQ-JG5Og%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1728603787,
            "review_datetime_utc": "10/10/2024 23:43:07",
            "review_text": "Delicious food & great service!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURuNWJYbl9RRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURuNWJYbl9RRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDn5bXn_QE%7CCgwIzL-SuAYQ-Iq4wwI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1728356300,
            "review_datetime_utc": "10/08/2024 02:58:20",
            "review_text": "Dulce was such a sweetheart! Thank you for the time here!! I wish there were more options for certain artist and songs. Other wise food is amazing and the rooms are amazing"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuXzhHaFh3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNuXzhHaFh3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICn_8GhXw%7CCgwIzZvxtwYQ-Jba4AI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1727811021,
            "review_datetime_utc": "10/01/2024 19:30:21",
            "review_text": "Definitely not the KBBQ that you're used to. It's not the kind of KBBQ where you'd cook raw meat in front of you. I'd say it's more like southern BBQ and Korean food under the same umbrella.\n\nAs there are many options of meat, it's hard to choose one. So me and my friends chose different thing's and tried each others meat. I ended up ordering the brisket, but that was the downfall. Maybe it was because it was later at night, the brisket ended up drier than I expected. The beef rib was for sure good as well as the crispy pork belly. The Ramen Mac and Cheese was pretty interesting. It's just another random vessel to get cheese into your mouth.\n\nThe service was pretty chill where they call your order up and you just pick it up. Nothing too fancy. They also have a bar for you if you want to pick up a drink separate from your food while you wait.\n\nThe location was pretty chill as there is a lot of space. We had a lot of people so we were able to sit all of us without being separated."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNuaThxSGx3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNuaThxSGx3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICni8qHlwE%7CCgwIsYXntwYQ8LaAhAM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1727644337,
            "review_datetime_utc": "09/29/2024 21:12:17",
            "review_text": "Downhill"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNucllDdDZnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNucllDdDZnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICnrYCt6gE%7CCgwI4KzgtwYQ2POwggE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1727534688,
            "review_datetime_utc": "09/28/2024 14:44:48",
            "review_text": "I mostly come here for their mocktails :D ... the lychee temple is great with and without alcohol ."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuNXZqa0t3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNuNXZqa0t3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICn5vjkKw%7CCgsIytXQtwYQ-Je0Ow%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1727277770,
            "review_datetime_utc": "09/25/2024 15:22:50",
            "review_text": "So fun to grab a karaoke room with friends!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNuaHNTN1FBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNuaHNTN1FBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICnhsS7QA%7CCgwIotDPtwYQuOfiiwE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1727260706,
            "review_datetime_utc": "09/25/2024 10:38:26",
            "review_text": "Came here for my son's bday . Wasn't impressed by the food. The 'no refund spicy' wings had good flavor but little meat. And the smoked brisket just tasted like steak. Nothing smoked about it. Nothing to write home about. Drinks are tiny and overpriced . I don't think I'd go back unless I wasn't the one paying."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNubk1TSDl3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNubk1TSDl3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICnnMSH9wE%7CCgsI79TGtwYQkP2WKw%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1727113839,
            "review_datetime_utc": "09/23/2024 17:50:39",
            "review_text": "my friend had a birthday party here, leo was our waiter & he did really well, it was a big group of us, food was pretty good, if you wanna do karaoke, come here ."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURBOWJ1ZXJBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURBOWJ1ZXJBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDA9buerAE%7CCgwIy--ItwYQoImR2AI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1726101451,
            "review_datetime_utc": "09/12/2024 00:37:31",
            "review_text": "Really disappointed in the quality of food served here these days. The quality has gone down ALOT. Yet food prices continue to increase. Do not order the chicken anymore. It's sloppy and thrown together. The Korean chicken \"crunch\" is completely gone. The kimbap is so small and has zero flavor now, there's no point in ordering it anymore."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNINVliRjZRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNINVliRjZRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICH5YbF6QE%7CCgsImpHvtgYQwN3qcg%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1725679770,
            "review_datetime_utc": "09/07/2024 03:29:30",
            "review_text": "DO NOT let old reviews fool you. This place is awful nowadays, it's clear they've given up on this location since opening a second seoul in NoDa. I have been ordering and recommending seoul food for over 5 years, even after moving almost 30 minutes away I was happy to drive for what used to be my favorite foot spot--that promptly ends today.\n\nI waited 10 minutes before even being acknowledged at the door, after being ignored (not missed, ignored) by the bussgirl 3 times as she rearranged menus in front of me. I'd normally chalk that up to a busy friday night, except for the fact that I was the only person at the door, all the tables were empty and clean, and the other 7 or so people in the building were all at the bar, being helped by the bartender. After being helped by another bartender (they removed all their servers because the owner doesn't want to pay them, according to a former employee) I picked up my togo order and went home. That was my second mistake.\n\nNot only was my order wrong, chicken chunks with fractured bones instead of wings, the sauce was forgotten by the kitchen. I called them and asked what was going on, and was told to hold for a manager who didn't show up. The same employee that answered the phone told me that \"ordered the wrong thing\" and that \"the kitchen said they added the sauce, it probably soaked into the wings and you didn't notice\". Ah, my dry wings simply drank the sauce! Maybe that's where it grew the bone chunks from!\n\nOh, and then she hung up after acting like she \"couldn't hear me anymore\". This business has fallen apart, and I'd sooner order from the dumpster across the street before I order from here ever again. A total waste of $50."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIenFtSHNRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNIenFtSHNRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICHzqmHsQE%7CCgwIlsnktgYQkN-W0gI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1725506710,
            "review_datetime_utc": "09/05/2024 03:25:10",
            "review_text": "Not bad, per se, but certainly not worth the price. The food was bland, which was super disappointing given that both fusion inspirations are usually so flavorful. Had to order at the bar, so had to get up and down any time we needed anything, and for being only one of three groups of people, we still had to raise our voices to hear each other over the loud music."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeXUtZ2NREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNIeXUtZ2NREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICHyu-gcQ%7CCgsIz_fctgYQiMGxTg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1725381583,
            "review_datetime_utc": "09/03/2024 16:39:43",
            "review_text": "The food was so good! Their wings and ribs are some of the best me and my boyfriend have ever had. The staff was nice and the service was decently quick. We'll have to come back next time we're in town!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNIeXRYNUVnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNIeXRYNUVnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICHytX5Eg%7CCgsImOfctgYQqPj6Mw%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1725379480,
            "review_datetime_utc": "09/03/2024 16:04:40",
            "review_text": "Very good food, though a bit pricey.\n\nTheir karaoke systems could use some work. We experienced technical difficulties and it is near impossible to figure things out on their Korean remotes. "
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNIZ3B5Wmh3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNIZ3B5Wmh3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICHgpyZhwE%7CCgsIgOTXtgYQwJDDUA%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1725297152,
            "review_datetime_utc": "09/02/2024 17:12:32",
            "review_text": "Food is great but the music is always too loud whenever I eat here"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3dS1mWTd3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQ3dS1mWTd3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID7u-fY7wE%7CCgwIupm_tgYQiKSAoQM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1724894394,
            "review_datetime_utc": "08/29/2024 01:19:54",
            "review_text": "Staff was rude to one of my friends. The whole time we were there, one of the staff members (seemingly a manager) was aggressive and just not friendly overall. When we were doing karaoke (a group of about 10) the room was small so we asked for them to adjust the air. It never happened and when my friend asked about it on our way out, that same staff member replied to her with \"I don't care\". Also the food was quite mediocre to say the least. Every thing was topped with FLIES. BOOOOOOOOOOOOOOOOOOOOO"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ3akw2Y2l3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQ3akw2Y2l3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID7jL6ciwE%7CCgsInPeZtgYQoJn3Vg%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1724283804,
            "review_datetime_utc": "08/21/2024 23:43:24",
            "review_text": "Do not be decieved. I went here with the intention of getting Korean bbq as shown on website pictures. Big time false advertising.\nMy wife and I had been craving Korean BBQ and discovered so we thought this place. After sitting for 5 minutes with no service I approached the bartender and she told me it was a picture from a place that has been out of business for sometime now. Don't be fooled"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3NmE3RERBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUM3NmE3RERBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC76a7DDA%7CCgsIrq3_tQYQ0OGGZA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1723848366,
            "review_datetime_utc": "08/16/2024 22:46:06",
            "review_text": "Truthfully for a place that I have been hearing great things about, it sucks. Bad. They have no servers and the poor bartender is backed up. They have a bunch of employees is in the back just standing around I am not sure what they even do. The poor hostess had to take our order as we were so confused when we first walked in and weren't greeted by someone once we sat down. I ordered the \"smoked\" brisket bao bun. It was tiny, unseasoned and DRY. The ram and cheese had no flavor. It's literal just ramen noodles in a dried up cheese sauce topped off with melted cheese. Their instagram practically catfished me because it looks so delicious online. Wings are good but nothing that screams wow especially given the fact that Korean food is known for their fried chicken. It's overpriced and the atmosphere sucks. What's the point in opening a restaurant like this? I would never come back again. Just know you have to pay before you eat and if you want sauces it's extra $$$. Might as well just be a take out place instead of a whole restaurant. It's lazy and sad."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3cXNxal9BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUM3cXNxal9BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC7qsqj_AE%7CCgwI9_vztQYQuNyjvQE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1723661815,
            "review_datetime_utc": "08/14/2024 18:56:55",
            "review_text": "The food is pretty okay, I would say not for its price though, at least during the lunch hours when I went. If you want some authentic Korean food, I would say skip this place, but if you just want a place to eat, then this is an okay choice, if a little pricy. Dishes are more focused on pictures than taste, aside from the kimbap which I actually very much enjoyed! This might all be from the food options I chose (fire chicken, dirty white rice, bao buns, kimchi Mac and cheese, and the bulgogi kimchi kimbap) but it definitely was not as hyped as it claims to seem. Overall choose at your own risk."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM3OHZLekdREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUM3OHZLekdREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC78vKzGQ%7CCgsIy-DytQYQgM-VDA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1723641931,
            "review_datetime_utc": "08/14/2024 13:25:31",
            "review_text": "Very pleasant dinner, albeit pricey"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3MUtmTy13RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUM3MUtmTy13RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC71KfO-wE%7CCgwI_cfqtQYQiMOghQM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1723507709,
            "review_datetime_utc": "08/13/2024 00:08:29",
            "review_text": "Poor customers service, the menu is complicated. I had  with flies competing for the food. The food: brisket was the toughest I've ever had, wings are huge, but so heavy on the batter and sauce so overwhelming - I'm quite sure they were frozen. All this with a Pepsi for over $55!? I can't believe it. This place might have had its glory days."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM3c0t2SS1BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUM3c0t2SS1BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC7sKvI-AE%7CCgsIwunjtQYQ-J2kFg%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1723397314,
            "review_datetime_utc": "08/11/2024 17:28:34",
            "review_text": "Fire Chicken was so mid. It was literally chicken breast with bbq sauce and cheese blowtorched so most wasn't even melted. The egg rolls were alright."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURiM051bnBnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURiM051bnBnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDb3NunpgE%7CCgwInsy2tQYQsKf5lAE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1722656286,
            "review_datetime_utc": "08/03/2024 03:38:06",
            "review_text": "Zhe Shi Yi Ge Mei Guo Can Ting ,Bu Shi Han Guo Can Ting . Lian Pao Cai Du Mei You . "
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidnFMZGN3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNidnFMZGN3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICbvqLdcw%7CCgwI8qKUtQYQqN3A7QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1722093938,
            "review_datetime_utc": "07/27/2024 15:25:38",
            "review_text": "Great food, quick service, I ate at their Mill District location,  reccomend their Pork Ribs with Sesame Oil.  Great atmosphere with a Splash Pad for kids, a dog area, nice courtyard with TVs.  We show them at 23:43 in our video of Charlotte"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNidHEtRmZREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNidHEtRmZREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICbtq-FfQ%7CCgsIh-6QtQYQkPPOUQ%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1722038023,
            "review_datetime_utc": "07/26/2024 23:53:43",
            "review_text": "Very meh experience , service was okay. Food was cold and dried out. The crispy pork belly was harder than a piece of wood to chew. The Beer was served in a plastic cup. Can't see this place lasting long sadly if this is what they offer."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURyMTRtdlpREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURyMTRtdlpREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDr14mvZQ%7CCgsI2e7xtAYQgNeFSA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1721530201,
            "review_datetime_utc": "07/21/2024 02:50:01",
            "review_text": "**Rating: **\n\nI recently placed an online order from Seoul Food Meat Company, and it was an absolute nightmare. The squid kimbap was disgustingly grainy, slimy, and completely inedible. I have had squid and kimbap in the past and enjoyed it. Total let down.   The mac and cheese was a joke--it tasted like plain spaghetti noodles mixed with the cheapest canned chili imaginable, with zero kimchi flavor.\n\nThe boneless chicken was another disaster. It was so rock-hard that I couldn't even put a fork through it, and to top it off, it had the wrong sauce. We were forced to throw out the entire meal because it was just that bad.\n\nAdding to the frustration, I called the restaurant five times to complain, but no one bothered to answer. This experience was a huge letdown, especially since we've had fantastic meals at their other location before.\n\nUnless these issues are addressed and corrected, we will never be returning. If the matter is resolved satisfactorily, I might consider updating this review, but for now, it stands as a warning to others.\n\nUpdate: Finally spoke to someone on the phone. I was  told that you have to email all concerns and nothing can be addressed over the phone. I was also told that a refund cannot be guaranteed. I am happy to change my review if I get a response and matters are addressed."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaTRtdHF3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURyaTRtdHF3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDri4mtqwE%7CCgwI1a7ttAYQuJK-0gM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1721456469,
            "review_datetime_utc": "07/20/2024 06:21:09",
            "review_text": "Best Tacos I've Ever Had!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURyaU8tbzhBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURyaU8tbzhBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDriO-o8AE%7CCgwI9IzKtAYQ2KWTuwI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1720878708,
            "review_datetime_utc": "07/13/2024 13:51:48",
            "review_text": "We walked inside, looked at the menu and food, and left! The place did not feel anything special, and for what the place and service looked like, the food here is significantly overpriced. You can find the same dishes in more expensive northern cities for nearly half the price. It's hard to tell if this is due to hype, a lack of competition, or both, but it feels like a rip-off. For reference, current prices (07/13/2024) of my favorite BBQ place in DC (I live in DC area):\nMeats:\nbeef brisket: $13.39, pulled pork: $9.39, pulled chicken: $8.99, two meats: $13.39, baby back ribs: $14, smoked salmon: $15.74, ...\nSides:\nBaked beans with bacon: $3.14, cold slaw: $2.99, fresh cut fries: $3.04, potato salad: $3.24, mac-n-cheese: $3.19, ..."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNyelptaHN3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNyelptaHN3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICrzZmhswE%7CCgwI2sK3tAYQgIfonwE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1720574298,
            "review_datetime_utc": "07/10/2024 01:18:18",
            "review_text": "Customer service is nonexistent in that place. The staff is extremely rude. Some just walk around looking like they're dead inside like zombies. The food took forever to come out and when it did it smelled horrible. We were so disgusted with the whole experience, we got up and left the food on the table.  Don't waste you're money or time here"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNyNmMtV1d3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNyNmMtV1d3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICr6c-WWw%7CCgwI4vextAYQ8OOD_gI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1720482786,
            "review_datetime_utc": "07/08/2024 23:53:06",
            "review_text": "Great customer service"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURMaV9tRUh3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURMaV9tRUh3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDLi_mEHw%7CCgwI_5eHtAYQgMTNtwM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1719782399,
            "review_datetime_utc": "06/30/2024 21:19:59",
            "review_text": "Food was fine, some items were good, others left some to be desired. Was quite expensive for bar only service and alright korean fusion."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURMdmV1ZXpRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURMdmV1ZXpRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDLveuezQE%7CCgwIot2CtAYQsO3L3gI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1719709346,
            "review_datetime_utc": "06/30/2024 01:02:26",
            "review_text": "20 dollars for pulled pork with no sides.(See picture) Plus you have to walk up to the bar and order, then go pick it up yourself. Not a good value proposition."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMMV9mTDVRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNMMV9mTDVRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICL1_fL5QE%7CCgsI_bPiswYQqMOcdA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1719179773,
            "review_datetime_utc": "06/23/2024 21:56:13",
            "review_text": "Very racist vibes. Tried to visit around 4pm on 6/18/24 and the little girl looked at my friend and I and said they weren't open. 15 minutes later, my friend and I are at the bar across the street and we see a group of white folks being served. I will be contacting management in regards to this, and taking it further if needed. "
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMay1QRm1BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNMay1QRm1BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICLk-PFmAE%7CCgwIj4HdswYQ4LO9kQM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1719091343,
            "review_datetime_utc": "06/22/2024 21:22:23",
            "review_text": "READ THE REVIEWS.  THE FOOD IS ABSOLUTE CRAP.  COME FOR DRINKS DO NOT EAT.\n\nOn the other hand Cheyenne is a wonderful waitress.  Absolutely spectacular.  None of this reflects on the service.\n\nThe food is bad.  It's cold.  You will not get comped.  They will offer something else but when the food is ice cold and tastes bad why would you order something else?  Don't waste your money.  Walk across the street and eat something else.  A cup ramen.\n\nTake this from someone who actually lived in Korea.  It's a disgrace to even call this stuff fusion."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdGJDTm1RRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNMdGJDTm1RRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICLtbCNmQE%7CCgsI6L7YswYQ0KTzAQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1719017320,
            "review_datetime_utc": "06/22/2024 00:48:40",
            "review_text": "Staff incredibly rude. Tried to thank one of the girls for the silverware even if they forgot it but she barely even smiled and said couldn't even say you're welcome when i said thanks. . Food was mediocre. Spiral potatoes had barely any flavor and tasted like flour."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMdHYyc3lRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNMdHYyc3lRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICLtv2syQE%7CCgwIlOvIswYQyMH40AM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1718760852,
            "review_datetime_utc": "06/19/2024 01:34:12",
            "review_text": "Booked for a karaoke session with friends. The room had one of the Korean machines (which tends to be popular at karaoke bars) but it was severely lacking in options compared to every other karaoke machine I've seen, even the Korean ones. The tablet was slow, there was no way to connect a third party app or device, and by far the worst part was the horrible selection of songs. If you searched up any famous artist you may know, they MIGHT have their 4th and 5th most popular songs, but never the most famous ones. A lot of our searches returned no results, and it's not like we had niche songs, we searched across a variety of genres. There were no results for Panic at the Disco, Nine Inch Nails, or Men at Work (which I would consider rather famous groups) and only a couple songs from groups like System of a Down, The Killers, Green Day, etc.\n\nI would NOT recommend coming here for karaoke unless you plan on singing Korean songs. I would also NOT come here for the bar as it was pricey and generic (2 shots of house tequila for $30, a rum and coke for $15)."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMcHF5TlZnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNMcHF5TlZnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICLpqyNVg%7CCgsI6_XGswYQ0JqHNA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1718729451,
            "review_datetime_utc": "06/18/2024 16:50:51",
            "review_text": "I love the atmosphere! The food isn't great or the customer service."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNMMnFyMEV3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNMMnFyMEV3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICL2qr0Ew%7CCgwI6-rEswYQwOitkAI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1718695275,
            "review_datetime_utc": "06/18/2024 07:21:15",
            "review_text": "Great atmosphere! The service wasn't the best. The lady standing beside the register with the dreads was extremely rude and she had a terrible attitude. I spoke with the manager and he was really apologetic for her behavior. While speaking with the manager she still tried to go back and forth with me. The food was okay definitely not traditional Korean food more American. The wing were extremely large and the best sauce was the soy garlic all of the other sauces were extremely overbearing on the wings. If you've ever visited Korea or had authentic Korean food this isn't the best restaurant for Korean food. The beef ribs are American beef ribs not the Korean Kalbi. The pork belly is good and crispy. The atmosphere was good I love the food hall atmosphere. There is an outside eating area with a play ground for children. Overall, the atmosphere was the best part of our experience at this establishment."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNMaktUTnRRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNMaktUTnRRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICLjKTNtQE%7CCgwIzfO4swYQkPr3ggM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1718499789,
            "review_datetime_utc": "06/16/2024 01:03:09",
            "review_text": "This food will literally change your life eat here please. Add it to your bucket list"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6dHNXR0JBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR6dHNXR0JBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDztsWGBA%7CCgsI4J2ZswYQqMTpdg%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1717980896,
            "review_datetime_utc": "06/10/2024 00:54:56",
            "review_text": "Beef ribs were tender but lacked flavor. Tofu was delicious, spicy or mild. Wings and cornbread were also great. My wife would have gotten the chicken if they would have removed the cheese. My daughter had the loaded fries and they removed everything without issue."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6MXRmWGFREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR6MXRmWGFREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDz1tfXaQ%7CCgwI9f-YswYQ4JWe9QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1717977077,
            "review_datetime_utc": "06/09/2024 23:51:17",
            "review_text": "Really cool spot with outdoor bar/games and great selection of food.\n\nThe wings, cornbread and ramen Mac & cheese were our favorites!\n\nYou get a good amount of food but it is a little pricey."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR6NUlDT0dREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR6NUlDT0dREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDz5ICOGQ%7CCgwI9I2NswYQ2MWW8QE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1717782260,
            "review_datetime_utc": "06/07/2024 17:44:20",
            "review_text": "When I walked in no one greeted me and told me if there would be a wait or not. The place was empty. It was not busy at all."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6dV8yejVnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN6dV8yejVnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICzu_2z5gE%7CCgwI0vKBswYQ6OTN0wI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1717598546,
            "review_datetime_utc": "06/05/2024 14:42:26",
            "review_text": "My friends and I booked a karaoke room to celebrate one of our friends getting married and the experience was really disappointing. Immediately when we walked into the building it seemed like the staff was just annoyed at our presence for no reason, and I wasn't the only person in the group who got that vibe. They also failed to tell me that I had to get this parking app in order to be reimbursed for parking, so I paid $8 to park in their lot. No big deal, but they also kept my ID as a deposit and forgot to give it back after the session. To be fair, I also forgot they took it but I wish they could have said something when I paid for my drinks before I left. I live out of town so I still haven't been able to get my drivers license back and nobody ever responded to any of my calls or emails. It's been about a month. As for the actual karaoke, this is probably the worst KTV place I've been to while also being the most expensive. The rooms aren't sound proof and the whole time we could hear other parties singing (loudly and badly) over our songs. Also the room was extremely hot and there were no fans available. After reading the other reviews it seems that their AC has been broken since February. The karaoke machine was all in Korean, which is not uncommon since most KTV places use Asian karaoke machines, but they usually also have a separate device or a way to connect your phone to let you navigate with an English system and give you a greater song selection. I'm not sure if Charlotte has any better KTV options (a real shame if they didn't), but this place just didn't do it for me. It's not worth the price--especially with the additional reservation fee, the parking fee, the automatic service fee, and my drivers license."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN6LTd6MkVREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN6LTd6MkVREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICz-7z2EQ%7CCgwIneiBswYQiPnmuwM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1717597213,
            "review_datetime_utc": "06/05/2024 14:20:13",
            "review_text": "sorry excuse for a business. all of the employees seemed less than thrilled to see me there. food was sub-par as there was a short curly hair in my entree (ew) and our drinks tasted like water. can't believe i gave this bogus company my money. rest assured i won't make this mistake again and i would advise you to do the same"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN6LTlUMWxnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN6LTlUMWxnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICz-9T1lgE%7CCgsI0uOBswYQ4IXPJw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1717596626,
            "review_datetime_utc": "06/05/2024 14:10:26",
            "review_text": "gross bathrooms, so many flies inside, found a piece of a receipt in my drink and the manager told me i should buy another one"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURUdnJPaXVRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURUdnJPaXVRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDTvrOiuQE%7CCgsIi7PFsgYQ6MKWfQ%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1716607371,
            "review_datetime_utc": "05/25/2024 03:22:51",
            "review_text": "I stopped in here recently with a group of friends to eat and hang out. They have validated parking which is a huge plus and a decent seating area for bigger groups. I ordered the bulgogi kimbap, bulgogi kimchi kimbap, and the sweet and mild boneless wings. The kimbap was pretty solid. The kimchi didn't have much flavor, but I would say the regular bulgogi kimbap was my favorite. The meat was flavorful and there was a nice hint of acidity from the pickled veggies. The wings were interesting. It was a mix of dark meat and maybe white meat but they were definitely huge and not traditional wings. I think these might actually be thighs because I have never seen wings this big. They were good, but if I came back, I would stick to the kimbap. Otherwise, a cool spot in the area to eat and catch up with friends."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUMHNuZmJnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNUMHNuZmJnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICT0snfbg%7CCgwI7ZSFsgYQiOfPmwM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1715554925,
            "review_datetime_utc": "05/12/2024 23:02:05",
            "review_text": "Good good and fun atmosphere!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUblBEQ2pnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNUblBEQ2pnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICTnPDCjgE%7CCgwI2NiAsgYQyIbCtAI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1715481688,
            "review_datetime_utc": "05/12/2024 02:41:28",
            "review_text": "The wings were straight up inedible. Asked the manager, Adam, for a refund, but haven't received it. He was extremely unprofessional."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNUbUx1TWh3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNUbUx1TWh3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICTmLuMhwE%7CCgwI3q_5sQYQ2MasrwI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1715361758,
            "review_datetime_utc": "05/10/2024 17:22:38",
            "review_text": "Don't waste your money."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNUb1Ayc0NnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNUb1Ayc0NnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICToP2sCg%7CCgwI0MH0sQYQkLTyxgI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1715282128,
            "review_datetime_utc": "05/09/2024 19:15:28",
            "review_text": "Really disappointing experience followed by horrible mismanagement from the manager Adam. Very unfortunate."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqLTd5MzZ3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURqLTd5MzZ3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDj-7y36wE%7CCgsI-8TrsQYQ2K-IDA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1715135099,
            "review_datetime_utc": "05/08/2024 02:24:59",
            "review_text": "Got recommended to this place by someone from slingshot. Good food, great service.\nCrisanne recommended me the kimchi fries. Tried them. They were . Ain't going to lie.\nI'm outta town and places like this are a must"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqcmY3NG5RRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURqcmY3NG5RRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDjrf74nQE%7CCgsIt6bisQYQuPflJw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1714983735,
            "review_datetime_utc": "05/06/2024 08:22:15",
            "review_text": "We had an extremely disappointing experience at the South End location on Saturday May 4 from 5p-7p.\n\nKaraoke: Although I reserved the Rock Star room well in advance, they did not notify me that the A/C was BROKEN! The room is supposed to fit 25 people max which MAY be possible if no one orders food, but it was IMPOSSIBLE with no A/C, therefore half of our group just stayed outside by the bar which defeated the purpose of me paying $100/hr for my group of 22.\n\nService: Although the servers themselves were very kind, it took forever for anyone to check on us for additional drink/food orders, they kept forgetting to bring our drinks and they didn't clear away our food after eating!\n\nThe food: TERRIBLE.\n\nLuckily my group was just happy to be all together celebrating so we made it work, but I will NEVER return. Hopefully this review helps someone before reserving for a large group!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqdGFMZUlnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURqdGFMZUlnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDjtaLeIg%7CCgsI0vvfsQYQiNyRLA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1714945490,
            "review_datetime_utc": "05/05/2024 21:44:50",
            "review_text": "Oh Seoul Food... what has happened? We booked a karaoke room for a Sunday Funday a week in advance. When we arrived, we learned that the air conditioner in the rooms had been broken since February (it's now May). Had I known this detail, I would have booked another location but that little tidbit was withheld. They provided us a large fan which moved the stuffy hot air somewhat around the room. Others that booked similar rooms left but we remained in the sweat lodge.\n\nFood was good despite not having a full menu. Service is good. I think the server knew every party would be frustrated by A/C.\n\nGood news: despite the lack of A/C, they still charged the full fee and did not credit the deposit on the bill."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURqMUk2VVlnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURqMUk2VVlnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDj1I6UYg%7CCgwI667AsQYQuMWirAM%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1714427755,
            "review_datetime_utc": "04/29/2024 21:55:55",
            "review_text": "My extended family rented one of the karaoke rooms for a couple hours and also ordered food and beverages. The food was pretty average. Who serves bao buns with no filling?\n\nBut the big problem was the horrible karaoke service. Since that was why we went there, it was a real bummer.\n\n1. It was 30 minutes into our 2 hr reservation before the staff member even got the karaoke up and running. Not acceptable.\n2. Guests CANNOT control the volume of the music or the volume of the microphones. This meant that when the backing sound went completely out on two different occasions, we had to sit around and wait for someone to come and unlock the cabinet to adjust it, and then we were stuck with whatever volume they left it set to.\n3. The selection kinda sucks. Seems like they were missing a lot of standard karaoke fare.\n4. The control technology was awful. There is only one tablet. Many of the buttons on the tablet didn't work and most were labelled in Korean. Heaven forbid if we wanted to raise or lower the key. Setting up a queue was nearly impossible. Searching for a song was a ponderous task similar to the dreaded entering of a long password by scrolling to and clicking on the keyboard on a smart TV. And if the tablet wasn't aimed right at the karaoke equipment stack, it didn't work at all. Honestly, it felt like equipment from 2005.\n5. Why in the world did I have to pay a reservation fee THAT DOES NOT GO TO THE ROOM RENTAL COST?\n\nOverall, this was a very poor experience and a bummer for me because I had really encouraged my family to give private karaoke a try. I did get the manager to refund 30 minutes of our time, but they should have refunded the whole karaoke fee. Save your money and buy a home karaoke machine for the same cost, with a vast library and easy controls."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURqbU8zanJnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURqbU8zanJnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDjmO3jrgE%7CCgsI-Oy7sQYQkNzXGQ%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1714353784,
            "review_datetime_utc": "04/29/2024 01:23:04",
            "review_text": "Leigha was an amazing bartender. She was so personable and guided us to our new favorite drinks! Can't wait to come back :)"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqbVk2dmtBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNqbVk2dmtBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICjmY6vkAE%7CCgwIhdmesQYQiJ2u0AE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1713876101,
            "review_datetime_utc": "04/23/2024 12:41:41",
            "review_text": "Came for drinks, snacks, and karaoke! The food was delicious and the drinks were cheap. We rented a small karaoke room that was reasonably priced for our group and had a great time. Our server Lily was incredible and went out of her way to bring a fan to our room since the A/C was out and made sure we had plenty of cold water. The karaoke machine was fun except it didn't have a lot of recent music from the past 2 years. We still had lots of fun-- will definitely be back!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNqaXZiSnVBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNqaXZiSnVBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICjivbJuAE%7CCgwIoPWLsQYQ6NKU6AI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1713568416,
            "review_datetime_utc": "04/19/2024 23:13:36",
            "review_text": "Don't waste your time and money! I watched a YouTube video highlighted this place a while ago so I thought I'd give it a try when I was in the area for a sports event.\nIt's a weekend afternoon yet not many custos. I should have been cautious but went ahead to order anyway. The pork belly smelled really badly. The 12hr rib tasted bland and dry. The only meat that's somewhat edible is the fire chicken (wing). The kimchi fries are oily but at least tasted okay. The chojang broccoli salad is just steamed broccoli in hot pepper chojang sauce, not even salt."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNqbkpQM2FBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNqbkpQM2FBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICjnJP3aA%7CCgwI0IeGsQYQiNKK4QI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1713472464,
            "review_datetime_utc": "04/18/2024 20:34:24",
            "review_text": "One of my food items was not available after I placed an online order. The restaurant called to make me aware the item was unavailable. I requested a refund of the said item. They told me they would refund me for my item. After following up multiple times, all of the managers I spoke with refused to take ownership and passed the buck with no resolution."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREeDhhcmVREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUREeDhhcmVREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDDx8areQ%7CCgwIrKLysAYQyIjRkAM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1713148204,
            "review_datetime_utc": "04/15/2024 02:30:04",
            "review_text": "Excellent food, beer and service!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUREN05Hd0xREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUREN05Hd0xREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDD7NGwLQ%7CCgwI7PnFsAYQiPahggI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1712422124,
            "review_datetime_utc": "04/06/2024 16:48:44",
            "review_text": "Everything tasted great. I would recommended the Fatty brisket Taco and the Soy Ginger Wings."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNENWRUUU93EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNENWRUUU93EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICD5dTQOw%7CCgwI-JuhsAYQgM-OrwM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1711820280,
            "review_datetime_utc": "03/30/2024 17:38:00",
            "review_text": "My 25 beef rib was 23 bucks of fat. I asked the cashier if this is normal and she said yes. I've waited to come here for a while. Took an overnight trip and this was a must. But I'm sad"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNEcHJmMC1RRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNEcHJmMC1RRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICDprf0-QE%7CCgsIysaRsAYQyKPQQA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1711563594,
            "review_datetime_utc": "03/27/2024 18:19:54",
            "review_text": "I would like to share a disappointing experience I had at Seoul Food, which prompted me to write my first review and decide never to return to this poorly managed establishment. This incident occurred on a Saturday evening when my son (50M) and I (83M) stopped by for dinner on our way home from the stadium. We approached the counter, placed our orders for different meals, my son's beer, and my soda pop, paid, and sat down to wait for our food.\n\nAfter a considerable wait (about 20 minutes), the waitress informed us that they were out of both meals we had ordered. She suggested we review the menu, but our second and third choices were also unavailable. They only had chicken wings and pulled pork left.\n\nAt this point, we realized that there was nothing on the menu that we wanted to eat, so we politely asked for a refund to go elsewhere. The waitress called her manager, who promptly refused our request, insisting that we order something they had available. We reiterated that there was nothing on the menu that we desired. We questioned why they charged us when they didn't have the food we ordered.\n\nEventually, the manager agreed to refund the cost of the food, but not the beer my son had ordered. My son argued that he had barely touched half a glass, and I had not even touched my soda pop. The manager begrudgingly agreed to refund 50% of the beer charge, which we paid before leaving. To make matters worse, the counterperson then loudly and rudely demanded that we leave, denying me the receipt to validate the refund.\n\nI am someone who has lived long enough to not let small inconveniences bother me, but this experience was embarrassing and disappointing. I hope that Seoul Food takes this as an opportunity for self-reflection and strives to improve their customer service."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEeHZqZk13EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNEeHZqZk13EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICDxvjfMw%7CCgwIvdqQsAYQ4OyXwQM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1711549757,
            "review_datetime_utc": "03/27/2024 14:29:17",
            "review_text": "GREAT PLACE!! BEST DJ!! Howeverrr, they need to redo the menu...Mac N Cheese is too creative..just use your spices not Ramen noodles....lemon pepper wings..simple menu with flavor..BBq chicken needs work...Cornbread is good....Thank you..."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNEd3YyRUZREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNEd3YyRUZREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICDwv2EFQ%7CCgwI4dyIsAYQ-PDYrQI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1711418977,
            "review_datetime_utc": "03/26/2024 02:09:37",
            "review_text": "Ribs were so tough. Cornbread was good. Chicken was good. There were only a few people in the restaurant and it still took forever to get them out. Good atmosphere"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQ5anRlMmJ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUQ5anRlMmJ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID9jte2bw%7CCgwI-9_XrwYQ8JeL6AI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1710616571,
            "review_datetime_utc": "03/16/2024 19:16:11",
            "review_text": "Went by for a drink was around 2 pm on a Saturday sat at the bar to order after what I thinks was about a minute started to count how long it was to get a drink after what was 8 minutes left was never asked what I wanted and I would give flack if it was busy which it was not"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ5anZtZXpBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQ5anZtZXpBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID9jvmezAE%7CCgwImL7XrwYQ2L7KmwE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1710612248,
            "review_datetime_utc": "03/16/2024 18:04:08",
            "review_text": "The pork belly is so crispy and delicious (One of the best pork belly I have ever tried). The vibe inside is nice and spacious."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5dmUzNHd3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUM5dmUzNHd3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC9ve34wwE%7CCgwIiMutrwYQqMPupgM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1709925768,
            "review_datetime_utc": "03/08/2024 19:22:48",
            "review_text": "Fantastic food and atmosphere. Great date spot."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUM5c1kzTnF3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUM5c1kzTnF3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC9sY3NqwE%7CCgsI_9GirwYQ6JW9dQ%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1709746431,
            "review_datetime_utc": "03/06/2024 17:33:51",
            "review_text": "I'm too old for a loud place like this. We probably should have gone outside to the patio for conversations ."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5X3VDOERREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUM5X3VDOERREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC9_uC8DQ%7CCgwI7-qfrwYQkJew_gE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1709700463,
            "review_datetime_utc": "03/06/2024 04:47:43",
            "review_text": "Went with friends for my fiance's birthday, and got one of their private karaoke rooms. However, when we got into the room it smelled very heavily like bleach and there was no AC running.\nWe didn't really think much of it and proceeded to have a good time, however when we were leaving my fiance noticed that my pants had been bleached.\nWe reached out to their customer service, but they told us that they dont use bleach on their cleaners, and that they actually checked the video and that the chairs in the room had not been wiped (i dont know if this somehow makes it better?).\nRegardless they didn't fix anything and I was out of a nice pair of pants. Would really hope that they would at least admit their fault and apologize so other customer's clothes don't suffer the same fate.\nAlso should probably wipe down the chair as part of your cleaning process."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM5cklmUWFBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUM5cklmUWFBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC9rIfQaA%7CCgwImMaTrwYQwKf0wgM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1709499160,
            "review_datetime_utc": "03/03/2024 20:52:40",
            "review_text": "I called about a problem we had, and the hostess hung up on me. In the past I've had a decent experience, but our karaoke experience was not good. I tried talking to them, kindly, twice and all I got was beyond rudeness. Really disappointing!!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkNWN6a1p3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURkNWN6a1p3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDd5czkZw%7CCgwI2qvtrgYQ2I3jowI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1708873178,
            "review_datetime_utc": "02/25/2024 14:59:38",
            "review_text": "Not a good place for a nice meal.\nWe got the pork belly, brisket, buns, and ramen mac and cheese.\nThe pork belly was cut into huge cubes you could hardly eat and was entirely unseasoned, we couldn't finish it. We lamented on how that flavor stuck with us through the night and we couldn't get rid of it. So chewy as well. Ramen mac and cheese is so low effort it's embarrassing for them that they serve it.\nAlso you seat yourself, order at the bar, and pickup your own food as well. Other food looked appetizing, but not anything we had."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkMmZYYklREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURkMmZYYklREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDd2fXbIQ%7CCgwIuJvrrgYQ6Or38QE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1708838328,
            "review_datetime_utc": "02/25/2024 05:18:48",
            "review_text": "The Philly Egg Rolls are the best thing since sliced bread. Sweet BBq wings are als9 very good."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURkd1BPS0dnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURkd1BPS0dnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDdwPOKGg%7CCgsIpr7QrgYQqPOVcQ%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1708400422,
            "review_datetime_utc": "02/20/2024 03:40:22",
            "review_text": "If you're looking for traditional authentic Korean restaurant ,this place is not the one your looking forp. Sounds very Korean( Seoul) but it a mix of American whatsoever cooking. Food is ok but disappointed. You can sit wherever vacant table . You'll be given menu. Order drinks and food in the bar. Then you will pickup your food from a table near the kitchen when your number is ready. The music was loud. This is more a bar type place.  BTW some of the previously uploaded pictures posted by other local google  guide here were from the Korean bbq restaurant next door that has fire recently. It was very misleading."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkMzlEYWZnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNkMzlEYWZnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICd39Dafg%7CCgsIj7XOrgYQkL6tVA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1708366479,
            "review_datetime_utc": "02/19/2024 18:14:39",
            "review_text": "The food was absolutely incredible! One of the most unique restaurant setups I've ever had the opportunity to witness. I had a lychee temple, fire chicken, and kimchi fries (all of which were delicious ). They had kpop videos playing on their TVs. The only unfortunate thing was that their Internet wasn't working so there would be moments of silence, however, this issue was solved. It had a modern feel but not the type of bland modern that you see within houses, it was more of a just updated atmosphere. You choose where you sit (nobody seats you) and you go to the bar to order. Overall, I will be coming here again, hopefully, they're able to reopen soon "
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNkeTd6S3pBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNkeTd6S3pBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICdy7zKzAE%7CCgwI4_7GrgYQgJf4hwI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1708244835,
            "review_datetime_utc": "02/18/2024 08:27:15",
            "review_text": "Good as always, the rib and some butterbeers always taste amazing. Potato salad is weird (apples, corn and raisins in it)"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNkeU55U2F3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNkeU55U2F3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICdyNySaw%7CCgwIu-6ergYQoKPLqQE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1707587387,
            "review_datetime_utc": "02/10/2024 17:49:47",
            "review_text": "Pretty mid, it was late at night so I was happy they were open"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR0aTgzaEF3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR0aTgzaEF3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDti83hAw%7CCgwI7rKLrgYQ0Pyb1wE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1707268462,
            "review_datetime_utc": "02/07/2024 01:14:22",
            "review_text": "Overpriced\nAll the food is between just okay and good enough\nThey somehow put together a playlist of of the most annoying songs no one knows. Not even K-pop. Just terrible music.\nThe \"no refunds\" sauce in their tofu is less spicy than sriracha\nCustomer service is kinda mid\nAlso ignore the photos of the Korean buffet next door. This is not a Korean buffet.\nKimchi fries were decent, ask for extra kimchi because there's not enough to taste under all the other stuff on top."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0NGMtZzVBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR0NGMtZzVBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDt4c-g5AE%7CCgwI3L2BrgYQ4Om-5AE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1707106012,
            "review_datetime_utc": "02/05/2024 04:06:52",
            "review_text": "The food was fantastic. Pork belly and chicken wings were some of our favorites. We will be back."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR0cXNYMTNRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR0cXNYMTNRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDtqsX13QE%7CCgsIo8D6rQYQ-J--Gw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1706991651,
            "review_datetime_utc": "02/03/2024 20:20:51",
            "review_text": "I Love This Place"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN0NExUdERREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN0NExUdERREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICt4LTtDQ%7CCgsI3qvWrQYQoP_4dA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1706399198,
            "review_datetime_utc": "01/27/2024 23:46:38",
            "review_text": "Let me start by saying I thought this was a buffet, and I went by myself. I did not know you had to cook your own food. I tend to dislike those places. I pay to go to a restaurant so my food will be prepared perfectly and served to me. That way, all I have to do is eat. That being said, for an honest review. The staff was very attentive and helpful with any questions I had and checked on me frequently. The atmosphere was inviting and exactly what you would expect, and the place was very clean. Now for the food. First,  they bring you lots of it. For the money you won't go hungry. It's almost too much for a patron eating by himself. Absolutely no problems there. For me personally,  it was hard trying to get the food cooked perfectly. The solid sirloin was the easiest to cook because it came out as 1 piece. The ribeye is rolled up, and they give you lots of it. Definitely share that entre, but it was hard to get a perfect cook because it was sliced so thin. The shrimp were a nice size, and the chicken was tasty except for the fact that it was hard to tell if done. If you have friends or family that like this kind of stuff, then this place is fantastic. It's much better than that place where you throw your food in boiling water. I'm just not a fan of working for my meal. So in conclusion, if I was into work, then I would definitely go here again. (Or friends that wanted to go) I would definitely recommend this place, but know what you are getting into."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUROaWRxXzdBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUROaWRxXzdBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDNidq_7AE%7CCgwI1Jq_rQYQ0JaDlAI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1706020180,
            "review_datetime_utc": "01/23/2024 14:29:40",
            "review_text": "Loved the food in this place. Beautifully cooked and very tasty. Only downfall is that they don't do table service. Atmosphere was cold. Room was basic and lacked warmth. Music was a bit loud."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNOMnRDU1BnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNOMnRDU1BnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICN2tCSPg%7CCgwIitOLrQYQoK7n0AM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1705175434,
            "review_datetime_utc": "01/13/2024 19:50:34",
            "review_text": "Just went for lunch... spent over $60 plus tip on food. My partner doesn't eat egg (hates the taste of plain eggs) or cheese (allergy). They said no menu modifications, so we asked what was in the menu items. They told us his food ingredients in the items he wanted and confirmed no eggs/cheese and then they came out with it very much having them they then told us we couldn't get a refund or get alternative food instead (even though they don't even know what in their food and work there every day). They then said we'd have to pay for more food to replace even though they don't know the menu/ingredients. HOW RUDE like zero customer service?! It was a girl with reddish hue hair and glasses lunch shift 1/13/24. I cannot get over this I've been working in restaurants forever and would never do this. GET THIS they didn't even show us the NO EGG NO CHEESE MENU that EXISTED!!! Was going to have company event here over 1K budget, but not anymore. Will go somewhere less stingy/more knowledgeable with better service. I just said sure just charge me at this point not worth it, but it kinda ruined my mood."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNObXZYcnl3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNObXZYcnl3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICNmvXrywE%7CCgsItcWLrQYQsNngew%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1705173685,
            "review_datetime_utc": "01/13/2024 19:21:25",
            "review_text": "Creative and inventive flavors , great ambiance, and friendly staff. Seoul food is a must try."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQxaWE3dlR3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUQxaWE3dlR3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID1ia7vTw%7CCgsIvtrtrAYQyKHDDQ%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1704684862,
            "review_datetime_utc": "01/08/2024 03:34:22",
            "review_text": "Legit"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQxaWR6aXVBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQxaWR6aXVBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID1idziuAE%7CCgwIss_trAYQqJOg8gI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1704683442,
            "review_datetime_utc": "01/08/2024 03:10:42",
            "review_text": "Overall, the place was nice and we enjoyed ourselves. Definitely a place to experience for yourself, date night, or family. The food taste is different and the games were fun; enjoyed watching karaoke."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxNWFiWUV3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxNWFiWUV3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC15abYEw%7CCgsImajNrAYQoMDxKg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1704154137,
            "review_datetime_utc": "01/02/2024 00:08:57",
            "review_text": "very chill place. The food is awesome and portion is great. potato salad was different (has fruit in it) but very good. I definitely will be back"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxb2JlcFNBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxb2JlcFNBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1obepSA%7CCgsIxKrDrAYQ6JHYJw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1703990596,
            "review_datetime_utc": "12/31/2023 02:43:16",
            "review_text": "Great service. Great beer. And great food. What else? Great games if ya bored. - Dalton"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdnZ2SENREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxdnZ2SENREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1vvvHCQ%7CCgwIr8DBrAYQkPielQI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1703960623,
            "review_datetime_utc": "12/30/2023 18:23:43",
            "review_text": "Do you think these NAZIS will ever apologize for the condescending mask policy photo they still have up now that it's been proven completely false?"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxbHVYYUtBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxbHVYYUtBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1luXaKA%7CCgwI_-65rAYQ8IX7mwI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1703835519,
            "review_datetime_utc": "12/29/2023 07:38:39",
            "review_text": "I got the 12hr rib and the fried crispy pork belly it was great. We had a party of 20+, so I would recommend getting a server and getting service at the bar all at the same time. My family who ordered at the bar food came faster. I am not for sure as to why. They have karaoke rooms you have to pay for per hour, so that is meh. But we still had a good time doing karaoke. It was just expensive; I recommend just buying a little karaoke machine and using your phone at home with family and friends. Also, they have their own music catalog to choose from, so they may not have what you like."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxcHRqNUJ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxcHRqNUJ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1ptj5Bw%7CCgsIxbq3rAYQkP_GfA%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1703796037,
            "review_datetime_utc": "12/28/2023 20:40:37",
            "review_text": "Food was very good and high quality! It's much like an American BBQ joint, order your food at the counter and pick it up in trays at another counter. They have a large variety of food options and flavors. Food was done relatively fast."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxM0lUUzlBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUMxM0lUUzlBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC13ITS9AE%7CCgwI5LSkrAYQyMu_1AM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1703484004,
            "review_datetime_utc": "12/25/2023 06:00:04",
            "review_text": "I highly recommend this spot for late night eats. Finished watching Hockey and stumbled upon this gem of a spot. Kimchi Fries are a must try!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxektXSER3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxektXSER3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1zKWHDw%7CCgwItaigrAYQkLrSzQM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1703416885,
            "review_datetime_utc": "12/24/2023 11:21:25",
            "review_text": "First time there and basically it is a self service.  Given the menu, informed we can sit anywhere and to place the order at the bar.  When the food is ready, the pager will buzz and we go pick it up. The food. We got the beef rib and fish.  Although the beef was tender and juicy, the meat was bland. The fish was very spicy on the outside but also the meat was bland.  The Ram-cheese was a big negative.  Something's should be left alone.  If it do come back, IF, I'll try the wings."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUMxdE9tMEpnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUMxdE9tMEpnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1tOm0Jg%7CCgwIjfqcrAYQ4IrM2QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1703361805,
            "review_datetime_utc": "12/23/2023 20:03:25",
            "review_text": "From out of state, stopped here for some good BBQ brisket, crispy pork belly and the soy chicken wings. All of it was delicious. Would recommend this place if you're in Charlotte."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUMxcUp5aXdnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUMxcUp5aXdnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC1qJyiwgE%7CCgwI3NmRrAYQoIqpxQE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1703177436,
            "review_datetime_utc": "12/21/2023 16:50:36",
            "review_text": "To begin when I first walked in I was ignored for about 5 minutes by the host. She appeared to be very preoccupied pouring drinks behind the bar for customers which is a huge concern within itself. When she finally decided to come up to me I was not acknowledge by any means. she continued to rummage around the host stand until I told her I was here for a carry out order. She proceeded to say nothing to me and handed me the wrong order, then took it back and slammed the correct bag on the counter and walked away. She clearly has not been trained properly in customer service. I hope managment is able to recognize this and help her reel in the unnecessary attitude because it makes the resultant look awful as a whole. Food is good though."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWbmRxeTF3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURWbmRxeTF3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDVndqy1wE%7CCgwIuIPvqwYQ0NSqiwM%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1702609336,
            "review_datetime_utc": "12/15/2023 03:02:16",
            "review_text": "I've never seen this form of American-Korean fusion food before. It was certainly worth the try and we enjoyed most of the food. Some of the food had melted Cheddar cheese blend on it, which was the most interesting choice.\n\nBulgolgi kimbap was my favorite thing we ordered, it's hard to go wrong with bulgolgi or kimbap. Kim-chili ramen mac sounded interesting enough for me to give it a try. It was much better than expected!\n\nThere was a super chill atmosphere so it was fun to kind of just hang out there."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURWdGUyTkZREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURWdGUyTkZREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDVte2NFQ%7CCgwIpdTsqwYQsOOk_QE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1702570533,
            "review_datetime_utc": "12/14/2023 16:15:33",
            "review_text": "BEST WINGS IN CHARLOTTE!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURWc3VDLTBBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURWc3VDLTBBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDVsuC-0AE%7CCgsInPzeqwYQgPGEfQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1702346268,
            "review_datetime_utc": "12/12/2023 01:57:48",
            "review_text": "Very disappointed in how the service and food has gone downhill over the years. First off we drove 45 mins to get to this restaurant - as soon as we walked in the front staff looked up at us and looked down. No acknowledgment, we saw the sign to sit wherever we want, we sat at the table for 10 minutes and no one came to us. I miss the old Seoul food. We got up and walked out. So sad we won't be returning."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNWaU5EQzdBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNWaU5EQzdBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICViNDC7AE%7CCgsI5r-6qwYQ2JLmXw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1701748710,
            "review_datetime_utc": "12/05/2023 03:58:30",
            "review_text": "Just had our annual holiday work party and was severely disappointed by the customer service provided. The food was good. The wait staff was helpful.\nWe rented a private room, my company spent hundreds of dollars only to come out to two of our cars being towed by the restaurant's hired tow company.\nI'd be more understanding if it wasn't a Monday night.\nI would have been more understanding except where one car was parked-there was no signage for required paid parking.\nI would have been more understanding if one car, that did pay, hadn't been expired by FOUR minutes. The expiration time was 9:25, the car was towed at 9:29.\nWhy are we paying hundreds of dollars at a restaurant that allows for this to happen. I completely understand towing on a weekend or even Thursday and Friday. That area is notorious for people parking and walking other bars and events, but on a Monday....they're going to allow this to happen at their establishment.\nHonestly even if our cars hadn't been towed, it's not good enough to have gone back."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsbDluUmNBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURsbDluUmNBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDll9nRcA%7CCgwIhbK2qwYQiOy63AI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1701681413,
            "review_datetime_utc": "12/04/2023 09:16:53",
            "review_text": "Great and delicious food"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURsdzR5YkJnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURsdzR5YkJnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDlw4ybBg%7CCgwI6oGyqwYQ4MCu4AE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1701609706,
            "review_datetime_utc": "12/03/2023 13:21:46",
            "review_text": "Food was great! The only item we would not say that's in our top 10 would be the collard green. We liked the concept of ordering at the bar then picking up our food at another station (business genius on saving money on staffing). The bartender was very helpful and patient as we ordered, it was our first time and we wanted to get a variety of menu items to try."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsNWF5TDRBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNsNWF5TDRBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICl5ayL4AE%7CCgwIy6n7qgYQ6LX4vAI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1700713675,
            "review_datetime_utc": "11/23/2023 04:27:55",
            "review_text": "Came here because it was recommended by a friend. Not sure if maybe it was just me but I didn't really enjoy the experience at this restaurant. To begin with you have to place you food order at the bar and pick up your order. Not sure why they would ask for tips if I am the one doing all the work. The food was alright but for the price I didn't really enjoy it. We tried a little of everything as recommended by my friend. Overall I don't really recommend this restaurant."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNsb2FUZmR3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNsb2FUZmR3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICloaTfdw%7CCgwIhofsqgYQ4OjFwwI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1700463494,
            "review_datetime_utc": "11/20/2023 06:58:14",
            "review_text": "Really good wings and brisket. Nice Sunday evening spot."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsdHBTUmdBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNsdHBTUmdBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICltpSRgAE%7CCgwIw8vgqgYQwMfNiQI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1700275651,
            "review_datetime_utc": "11/18/2023 02:47:31",
            "review_text": "I have been a fan since I was introduced to this establishment 3 years ago.\nI usually make a pit stop when I'm in town from Atlanta to at least order beef ribs to go.Two weeks ago , I met a friend there for dinner. We had drinks and dined in. He was delighted with the Tilapia and I ordered a beef rib, slaw and corn. Unable to eat the hearty portion I wrapped the rest.  At about midnight my stomach turned and I had diarrhea for over 24 Hours.  The Seoul Meat Company meal is all I had eaten since Coffee and Egg for breakfast.  I contacted the restaurant to return the food and report my experience. Bobby, was the day Manager and he  told me that he would inform Adam, the Manager who handles these matters. After two days I called again and was told by Bobby that Adam had called me three times.  I never received a call or message from Adam. After two weeks I called  during the evening when Adam is on duty and was told by him that I ignored his calls and that he would issue a gift card for the sides. I questioned why and was told that I didn't have to bring back the rib. Adam lacks customer service skills and the acumen to handle such matters. I asked him to refer my issue to the owner and he told me to Google and email him.  Adam was rude, crude and obnoxious. The service has always been delightful and I have enjoyed the food until this experience. HOPEFULLY TIM WILL READ THIS REVIEW VONTACT ME AND COACH ADAM ON CUSTOMER RELATION INTERACTION."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNsZ0ttcjFBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNsZ0ttcjFBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIClgKmr1AE%7CCgsI-pbDqgYQ8LfxAw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1699793786,
            "review_datetime_utc": "11/12/2023 12:56:26",
            "review_text": "Best food EVER. This food had our mouths in a chokehold. We got the ribs, kimchi fries, cheesesteak egg rolls, and wings. Everything was phenomenal. The smoky bold flavors smack you in the face it's so good."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURGOTVub2pBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURGOTVub2pBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDF95nojAE%7CCgwImfe9qgYQwNzT2AI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1699707801,
            "review_datetime_utc": "11/11/2023 13:03:21",
            "review_text": "Some of the best korean food i've ever eaten we'll go back again"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURGNnFTOUZREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURGNnFTOUZREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDF6qS9FQ%7CCgwI54-fqgYQyJnXnQI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1699203047,
            "review_datetime_utc": "11/05/2023 16:50:47",
            "review_text": "I've been here several times and each time it's been great! I get the pork belly usually and spareribs."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNGbWFIdnlnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNGbWFIdnlnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICFmaHvygE%7CCgwIo_z3qQYQgJuM8wE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1698561571,
            "review_datetime_utc": "10/29/2023 06:39:31",
            "review_text": "Great music and great people!! It was my first time here and I had such a great time with my friends.\n\nI'm only giving it a four bc I think the sauces for the wings could've been better, but I rate rlly harsh on that end of things. I'd go again!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNGLVBPR0d3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNGLVBPR0d3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICF-POGGw%7CCgsIrbzvqQYQ2OqgNQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1698422317,
            "review_datetime_utc": "10/27/2023 15:58:37",
            "review_text": "This review is direct towards the new Urban Market location. My husband and I have loved Seoul Food in the past and continuously bring people who visit from out of town.\n\nWe decided to head over to the Urban Market location last Friday night. It was pretty dead inside and we ordered some pork belly, the soy garlic wings and some elote corn. They have increased prices substantially but I figure their rent is high in this area. Our issue is the the soy garlic wings, which we've had many times before, they were super dry, there was almost no sauce on them. We asked nicely if we could have a little extra sauce and they absolutely refused...when I pay a ridiculous amount for wings and you hand me dry ones, it makes no sense to not give the customer a little sauce. They did offer me other sauces that they had sitting out though like hot sauce and bbq sauce...if you've ever had these wings, you would not want this on them, they are soy garlic!!! Never in my life have I experienced such terrible customer service. I am not sure we will ever return to either location after this experience. Saving a few cents on sauce to lose customers, nice job.\n\nOther small issues, the line to order makes no sense at this location. The elote corn was not good, it was the first time we had gotten it however, it was caked in too much dry cheese and has some sad amount of tajin spice on it."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUQ1MHRYajV3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUQ1MHRYajV3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID50tXj5wE%7CCgwI-7DRqQYQuJPP6wI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1697929339,
            "review_datetime_utc": "10/21/2023 23:02:19",
            "review_text": "The website is always down for to-go orders and when you try to order over the phone they blatantly tell you no. Get your website fixed or take orders over the phone like a normal restaurant."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaNllIWDBBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURaNllIWDBBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZ6YHX0AE%7CCgsIpYiSqQYQ2Lz_Ug%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1696891941,
            "review_datetime_utc": "10/09/2023 22:52:21",
            "review_text": "Try the kimbop it's amazing l! I am putting your Down to a 1 star because of their shady business practice. When you place an online order they put a required tip on order with no option to edit the amount. I tried to call the restaurant to do a pick up order and she said I could only place online, this requiring I tip. I work food industry and usually tip well but making it a required tip on an online is a terrible business practice for your customers. Pay your employees they shouldn't have to live off tips."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a1BUQkp3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUM1a1BUQkp3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC5kPTBJw%7CCgwIpPOPqQYQkJ6gyAI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1696856484,
            "review_datetime_utc": "10/09/2023 13:01:24",
            "review_text": "Excellent food. So far the best food I've had in the US, and the staff were so helpful with all my food allergens. 10/10 do recommend."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUM1a1BpYlFBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUM1a1BpYlFBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC5kPibQA%7CCgwIxPCPqQYQuMr0ngM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1696856132,
            "review_datetime_utc": "10/09/2023 12:55:32",
            "review_text": "Bella is absolutely amazing. 10/10 food"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaaTlIbnhnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURaaTlIbnhnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZi9HnxgE%7CCgwI8ZKHqQYQyKfWgwE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1696713073,
            "review_datetime_utc": "10/07/2023 21:11:13",
            "review_text": "Really enjoyed the atmosphere of this restaurant, a lot of seating indoor and out. Service was good for the cafeteria style arrangement, drinks were tasty not much alcohol but delicious. The menu has a variety of options, however I found everything I tried to be missing something in flavor. Also, karaoke rooms are fun."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabmREQnJRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURabmREQnJRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZndDBrQE%7CCgwI6P-AqQYQgJinlwE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1696612328,
            "review_datetime_utc": "10/06/2023 17:12:08",
            "review_text": "Download the ParkMobile App and pay. Go inside and get the code from the hostess for parking. You get the menu from the hostess and sit where you want. Order from the hostess and pick up your food. Limited parking. The 12 hour rib had a lot of fat on it. Potato on a stick was good. Would be nice to have pictures and descriptions of the food. Played K POP music."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURaMGJpU0RBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURaMGJpU0RBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZ0biSDA%7CCgsIotztqAYQ0JzQUw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1696296482,
            "review_datetime_utc": "10/03/2023 01:28:02",
            "review_text": "My god these wings are delicious. Meaty, saucy, and juicy wings. Flavor is incredible. Baked ramen is surprisingly good. Get the spicy wings."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaOXMzYzZRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURaOXMzYzZRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZ9s3c6QE%7CCgsI8OrhqAYQ6JD3AQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1696101744,
            "review_datetime_utc": "09/30/2023 19:22:24",
            "review_text": "If I could give the food quality anything lower than a one I I would their food is absolutely terrible. Do not eat there!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURacHVPMWp3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURacHVPMWp3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZpuO1jwE%7CCgwIuN_dqAYQ8Iy6ogI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1696034744,
            "review_datetime_utc": "09/30/2023 00:45:44",
            "review_text": "I took my staff there for birthdays celebrations.  Enjoy "
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURabXMzam9nRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURabXMzam9nRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZms3jogE%7CCgwI4N3YqAYQ0L-g5wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1695952608,
            "review_datetime_utc": "09/29/2023 01:56:48",
            "review_text": "potato swirl is great!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURaektQc3Z3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURaektQc3Z3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDZzKPsvwE%7CCgwI6cTIqAYQ8IiSlAI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1695687273,
            "review_datetime_utc": "09/26/2023 00:14:33",
            "review_text": "I enjoyed the food"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaNl9HNTlRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNaNl9HNTlRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICZ6_G59QE%7CCgsIv7WhqAYQuKXuOw%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1695046335,
            "review_datetime_utc": "09/18/2023 14:12:15",
            "review_text": "Service is non existent. I had an issue with a food item and the manager straight up refused to do anything about it.  The outdoor space for the kids is great...but no kids menu. The wings are okay but everything else we ordered was just meh. Some of the food is way overpriced and some of it is fair."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaaV9Mc0lnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNaaV9Mc0lnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICZi_LsIg%7CCgwIldyeqAYQgIKipgI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1695002133,
            "review_datetime_utc": "09/18/2023 01:55:33",
            "review_text": "My wife and I visited this weekend, the seating wasn't comfortable at all! Chairs had no cushion, outside seating were high school lunch tables! Menu had no pics so we could have an idea what were getting. My brisket had absolutely no flavor & wasn't done! The fries I ordered were drowning in some \"barbecue\" style sauce & \"cheese\" sauce......DISGUSTING!!. My wife ordered mac n cheese, it had RAMEN NOODLES in it !! The nail in the coffin, my wife ordered fried tilapia........she damn near ran away from the table because the head & fins were still attached!!!!!! I wouldn't feed a dog that \"food\"! The manager was very understanding about our situation and refunded our money. Avoid this place at all costs!!!!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadWRmc2N3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNadWRmc2N3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICZudfscw%7CCgsIyuWIqAYQsMStOw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1694642890,
            "review_datetime_utc": "09/13/2023 22:08:10",
            "review_text": "Everything I've had from this place is good"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNadW9URUpREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNadW9URUpREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICZuoTEJQ%7CCgwIncvupwYQuIzKqAI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1694213533,
            "review_datetime_utc": "09/08/2023 22:52:13",
            "review_text": "Went with a few families with kids. Awesome place. Busy with a full parking lot but a little patience will get you a spot. Both kids and adults enjoyed it. Playground and splash along with table games to keep everyone happy. The food was delicious and the beer (an extensive selection on tap) cold. Hope to visit again. Highly Recommend."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNaMHZHbG1RRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNaMHZHbG1RRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICZ0vGlmQE%7CCgsIyL_npwYQuO3PZw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1694097352,
            "review_datetime_utc": "09/07/2023 14:35:52",
            "review_text": "Food 4/10  it just taste like soy sauce"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNaZ3RxdkN3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNaZ3RxdkN3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICZgtqvCw%7CCgsIm4DjpwYQkOniBg%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1694023707,
            "review_datetime_utc": "09/06/2023 18:08:27",
            "review_text": "To many employees standing around joking and not helping! You have to go and order at the bar and also pay your tab before you get your food. Food is just okay but the service is horrible! They don't explain anything and just walk around doing nothing. Even the manager doesn't speak to you. We will never go back. Please read all of the reviews before spending your money!!' Also Parking is horrible and no one explains how it works...."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwNjhhckhBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURwNjhhckhBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDp68arHA%7CCgwIo-i3pwYQqLWM5wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1693316131,
            "review_datetime_utc": "08/29/2023 13:35:31",
            "review_text": "Awesomely different flavor and vibe. It was a slow night, other patrons were sorta lame but we had our own vibe and had an amazing time.  Seasonal music bingo was fun. The karaoke rooms were full and seemed lit. Outside patio and music were on point.\n\nFood is delish. Fried pork belly, mac n cheese and soy garlic wings... will def be back.\n\nParking is lame too, but you just gotta walk or pay. Service is meh, but the food and vibe are worth it.  Cooks are "
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwczdDblRnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURwczdDblRnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDps7CnTg%7CCgwI2aKzpwYQkMKtkwM%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1693241689,
            "review_datetime_utc": "08/28/2023 16:54:49",
            "review_text": "Wings were good but too much sauce. We also enjoyed the pork egg rolls. Smoked pork ribs were just ok.\nStaff was nice."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwZy1Qbnl3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURwZy1Qbnl3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDpg-PnywE%7CCgsIzYmvpwYQ6IWgOw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1693172941,
            "review_datetime_utc": "08/27/2023 21:49:01",
            "review_text": "The food is awesome but when ordering my Margarita I asked for a certain liquor and was given a cheaper one but for the price of the one I ordered. BBQ was great but bartenders are shady beware"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURwbVphQWd3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURwbVphQWd3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDpmZaAgwE%7CCgwInImfpwYQwMjE_gE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1692910748,
            "review_datetime_utc": "08/24/2023 20:59:08",
            "review_text": "soy garlic wings used to be so good - now they are just ok"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwZ2VUQ1FnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURwZ2VUQ1FnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDpgeTCQg%7CCgwI9-yVpwYQ8MT3vwI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1692759671,
            "review_datetime_utc": "08/23/2023 03:01:11",
            "review_text": "Service was horrible, very non chalant workers. It's very confusing that it's a sit your sled order at the bar type of deal. The menu has no descriptions so you have no idea what you wanna eat. The food that I did get was undercooked. I wouldn't come back"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwa3MyOWZ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURwa3MyOWZ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDpks29fw%7CCgwI_9-ApwYQwNLnjQI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1692413951,
            "review_datetime_utc": "08/19/2023 02:59:11",
            "review_text": "Food is fantastic, and outdoor area like a patio that is very cozy along with a dog park so you can bring your dog and it's fabulous!!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURwaVBiYmFREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURwaVBiYmFREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDpiPbbaQ%7CCgwIh7DrpgYQ4KCY2gI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1692063751,
            "review_datetime_utc": "08/15/2023 01:42:31",
            "review_text": "Love the unique atmosphere..... Food  and drinks was great...the skins are to die for...the dino rib was not only a sight to see but very flavorful and tender.... I ordered about seven different items soo much food...would go back in in the CLT area"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwbzZqSzNnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNwbzZqSzNnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICpo6jK3gE%7CCgwI4ZHOpgYQ6IDl5AI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1691584737,
            "review_datetime_utc": "08/09/2023 12:38:57",
            "review_text": "Great food! A bit confusing about the ordering process, but it went well at the end."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwdmQ3QjdBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNwdmQ3QjdBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICpvd7B7AE%7CCgwIg63LpgYQyJXszgI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1691539075,
            "review_datetime_utc": "08/08/2023 23:57:55",
            "review_text": "Food was excellent!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwblp1REtnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNwblp1REtnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICpnZuDKg%7CCgwI8JTKpgYQ6OrW_AE%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1691519600,
            "review_datetime_utc": "08/08/2023 18:33:20",
            "review_text": "My best friend came to town and I was excited to take her here because I'd heard great things but hadn't been there yet myself. I should have chosen better. We walked in the door and waited awkwardly for the employees to finish their conversation. Then once they had finished, they asked if we wanted drink menus, handed them to us, and stood there expectantly. I told them we hadn't been here before and I was told 'sit anywhere and you just order at the bar when you're ready' then they went back to their conversation. I asked if they validated parking and was told 'we give you a code before you leave'. After ordering at the bar, we were given a buzzer (but not told what it was or where to pick up the food) and as we were walking away, the host said 'I need your card' to have us pay before being seated - despite the general restaurant setup that suggested otherwise. Eventually, the host brought the validation code to our table but didn't explain that the code can only be entered using ParkMobile app which I didn't have. I ended up paying for parking using the ParkMobile website.  The whole experience was confusing, the service was nonexistent (maybe that's how it's supposed to be?), the food was average but overpriced. The first thing I did as we left was apologize to my friend and ask her if she wanted to stop by the Chik Fil A near my house. She said yes."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwd2FmcHFnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNwd2FmcHFnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICpwafpqgE%7CCgwIy5-3pgYQsP2K5wE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1691209675,
            "review_datetime_utc": "08/05/2023 04:27:55",
            "review_text": "It is a very nice place and excellent atmosphere, the service is 100"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcnVpbm1nRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNwcnVpbm1nRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICpruinmgE%7CCgwIgfqwpgYQyIDIiQI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1691106561,
            "review_datetime_utc": "08/03/2023 23:49:21",
            "review_text": "I'm not really into Korean food, but the good thing is there's a great barbecue section which will satisfy everyone. They just add their own Korean inspired sauce, which wasn't too different to Carolina bbq sauce. The brisket was amazing. As we're the Kimchi Beef fries. Serving sizes are large, so share. Enjoy."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSXzZYZ3JRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURSXzZYZ3JRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDR_6XgrQE%7CCgwIubyrpgYQ0LiKgwE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1691016761,
            "review_datetime_utc": "08/02/2023 22:52:41",
            "review_text": "Decent spot if you're looking for a fusion of Korean and American BBQ."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNwcHFqRzFnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNwcHFqRzFnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICppqjG1gE%7CCgwIucmqpgYQsNWF-wE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1691002041,
            "review_datetime_utc": "08/02/2023 18:47:21",
            "review_text": "Food was a little pricey, but generally, Korean inspired flavorful.  I had kimchee fries (beef) and a large order of wings (spicy bbq and soy garlic- I liked these better!).  You order at the bar and then have a seat until your meal buzzer goes off.  Then you have to go get it with your drink from a designated pick-up area. I tested the broccoli and cucumber salad with hot chili paste. They were both ok, but the nod goes to the ladder... It can get crowded if a large party comes in, but they did have some outside seating.  Parking can be tight at this location(Church St.) when events and football are going on at the stadium. Overall I will come again!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN5cnBPdXVRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN5cnBPdXVRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICyrpOuuQE%7CCgsI78ajpgYQ6LqzEw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1690887023,
            "review_datetime_utc": "08/01/2023 10:50:23",
            "review_text": "Food was disappointing and I've been there several times. I got birds nest sweet potatoes fry thingy,  spring roll (both very good) & brisket  which wasn't good at all. Wouldn't go back."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwbkpyVmV3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNwbkpyVmV3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICpnJrVew%7CCgwIkeCZpgYQiN399AE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1690726417,
            "review_datetime_utc": "07/30/2023 14:13:37",
            "review_text": "Didn't eat the food, but we did karaoke! So much fun! The restaurant itself smells like old beer, but the karaoke room we were in smelled fine. Vast array of songs! Very impressed and had a blast! Staff was fantastic at keeping drinks coming."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNwck5PZ0NREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNwck5PZ0NREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICprNOgCQ%7CCgsI6NOYpgYQ0IO7QQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1690708456,
            "review_datetime_utc": "07/30/2023 09:14:16",
            "review_text": "Our waiter, a younger male with black hair and and ear piercing, dropped 2 drinks on my lap. No big deal, mistakes happen. He then proceeded to leave without apology, NEVER came to clean up the mess he made, AND tried to charge my friend for the drinks HE spilled. When we alerted the manager that nothing was done to clean the mess, they sat a wet floor sign in the karaoke room for 30 mins until someone finally came to mop it up. This place is a joke and so is everyone who works there.  Worst service I've ever experienced. The manager informed us that the waiter would have to pay for the drinks that he spilled, and that's why he decided to lie and say WE spilled the drinks, to save himself the $20. All around, horrible business practices and I'd avoid coming here."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcjd2ZmhRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKcjd2ZmhRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJr7vfhQE%7CCgsI2pL_pQYQoJfDMA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1690290522,
            "review_datetime_utc": "07/25/2023 13:08:42",
            "review_text": "We love this place. If we're ever down this way (about 30 miles from home) we always go out of our way to make a stop. Parking has however gotten worse but the food is just a awesome as ever. I highly recommend it. The wings and tofu are staples, the tacos are heaping with flavor, and be sure to get the baked Ramen Mac & Cheese."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKLTZYX1NBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKLTZYX1NBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJ-6X_SA%7CCgwIqIv2pQYQoK3jjwI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1690142120,
            "review_datetime_utc": "07/23/2023 19:55:20",
            "review_text": "Food was awesome nice soul food ."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbTZIMVNBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKbTZIMVNBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJm6H1SA%7CCgsI6PXzpQYQwJmoWA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1690106600,
            "review_datetime_utc": "07/23/2023 10:03:20",
            "review_text": "Had a birthday party in the karaoke room here and it was awesome. The food was great, the drinks were great, and there were a ton of awesome karaoke songs.\n\nMo did a great job as well - he was super cool, very helpful, and provided excellenet service - thanks a bunch!\n\nMy wife has been wanting to do karaoke for years and had a great time and very memorable and happy birthday party. Thank you very much."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKcmV2ZnJRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKcmV2ZnJRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJrevfrQE%7CCgwI_NvtpQYQwP75kwE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1690004988,
            "review_datetime_utc": "07/22/2023 05:49:48",
            "review_text": "As a personal opinion, the food is okay but was taken down a star since it was basically a self serve experience that I do not wish to repeat."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKemRLa0lnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKemRLa0lnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJzdKkIg%7CCgwIhPvrpQYQoM32kAM%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1689976196,
            "review_datetime_utc": "07/21/2023 21:49:56",
            "review_text": "Ordered for takeout. Kind waiter/cashier. Seemed like a nice place for a tinder date or to go be rowdy respectfully with friends. Other than that probably would visit again. Might recommend to others. No guarantee because the gimbap was not the best and I've been carouseling CLT for good gimbap for a while. Otherwise, it's pretty nice. I paid exactly 17 dollars for two orders of gimbap. Slightly worth it. Not too expensive but found better elsewhere still for a less expensive price."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbWJXZE9REAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKbWJXZE9REAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJmbWdOQ%7CCgwIxeHhpQYQ2J6R9AI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1689809093,
            "review_datetime_utc": "07/19/2023 23:24:53",
            "review_text": "Food is average at best. Will not be returning."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUQyanFycWJBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUQyanFycWJBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgID2jqrqbA%7CCgwIpK_apQYQqInLzAE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1689687972,
            "review_datetime_utc": "07/18/2023 13:46:12",
            "review_text": "Best BBQ wings in Charlotte."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKbnBxNnJnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKbnBxNnJnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJnpq6rgE%7CCgwI87vVpQYQuNKC1wE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1689607667,
            "review_datetime_utc": "07/17/2023 15:27:47",
            "review_text": "I love their wings, Kimchi fries, and brisket tacos! Their food is always good when I come here. They have a few outdoor areas where you can sit and dine if you don't want to eat inside. The bar is nice with a variety of drink options. The wings....their breading and sauce combination...best thing ever!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKenFEMHJ3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKenFEMHJ3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJzqD0rwE%7CCgwI7ZXTpQYQqMadnQE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1689570029,
            "review_datetime_utc": "07/17/2023 05:00:29",
            "review_text": "Chairs are little uncomfortable I guess that's meant for you not to stay long  so hard"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbHJ1alJnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKbHJ1alJnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJlrujRg%7CCgwIzMfPpQYQqN-01QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1689510860,
            "review_datetime_utc": "07/16/2023 12:34:20",
            "review_text": "Go!!!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKcHBLRlRnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKcHBLRlRnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJppKFTg%7CCgsIkbPNpQYQ0PHvWw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1689475473,
            "review_datetime_utc": "07/16/2023 02:44:33",
            "review_text": "Our recent visit to this establishment marked our first return since the onset of the COVID-19 pandemic. We noted that the service model has shifted to a more self-sufficient approach, with customers placing orders at the counter and refilling their own beverages. Staff members are responsible for delivering food to the table. The cuisine remains exceptional, with standout dishes including the crispy pork belly and beef ribs. Other menu items may appeal to more adventurous palates. Parking can be challenging, and it may be necessary to seek street parking further from the restaurant. Despite this minor inconvenience, we will certainly return for the outstanding food."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeHZPUDdRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKeHZPUDdRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJxvOP7QE%7CCgsIt-jMpQYQ2KWHRQ%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1689465911,
            "review_datetime_utc": "07/16/2023 00:05:11",
            "review_text": "Wild. I was reading the reviews to see if our experience last night was just an outlier, but nope. Apparently this restaurant is just trash. Our drink order for 3 drinks was just horrendous. One soju and 2 mixed drinks, we basically got 4 random cocktails. When we complained, the manager came over and tried to kick us out! We walked out without drinking the drinks or being reimbursed. Horrific experience. Stay away at all cost!!! Not a place worthy of business!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKeHUzZTZnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKeHUzZTZnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJxu3e6gE%7CCgwIyNnMpQYQ6KXz-gE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1689464008,
            "review_datetime_utc": "07/15/2023 23:33:28",
            "review_text": "Came in last night with my boyfriend and the staff were incredibly rude. The manager cussed at him for trying to fix his order and wasn't helpful even a little bit. Horrible restaurant"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKaHQzaDFBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKaHQzaDFBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJht3h1AE%7CCgwI9OjLpQYQ8OukgwI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1689449588,
            "review_datetime_utc": "07/15/2023 19:33:08",
            "review_text": "I have never been treated so rudely as I was at this restaurant. Came in last night with friends and tried to order wings and some fries. Somehow my order got confused to Kimichi fries with chicken. No big deal, I went back to the bar and asked them to fix it. The bartender directed me to a male, light skinned manager (he wouldn't tell me his name so all I have is a description) who proceeded to not only call me a liar about what I ordered, but cussed at me for trying to get the order fixed. I first asked just to return the food that was incorrect and have it fixed, he refused and got mad when I tried to ask how that was fair. He just kept saying \"it was made, so you have to eat it\". Never heard that one before. Then I asked to have a refund because my friends and I just wanted to leave at that point and the food was still sitting on the counter untouched. Again he started cussing at me and said that he wasn't going to refund food that was made and I could either eat it or leave it. I then asked for a box so I could just leave, and he refused to even do that. Another employee was kind enough to get me one. I recorded the whole thing and had planned to post it, but Seoul Food as a whole doesn't deserve to be punished for one horrible manager. Completely inappropriate and rude behavior. Coming from a General manager of almost 10 years, this man should not be in charge of any respectable establishment. On a positive note, the chicken kimchi fries were actually good."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbW9yVEV3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKbW9yVEV3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJmorTEw%7CCgwIhbrIpQYQ6MWpnQI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1689394437,
            "review_datetime_utc": "07/15/2023 04:13:57",
            "review_text": "They will try to charge you for anything. The management is a joke. They tried to kick us out of karaoke room 30 mins early, then charge us $350 for dropping a mic.  Management laughed along with employees talking about what contract.  The same contract they are trying to charge $350.  DO NOT COME TO THIS ESTABLISHMENT!!  THEY ARE CLEARLY IN NEED OF MONEY!. They breach their own contracts."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKbW9xbUJBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKbW9xbUJBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJmoqmBA%7CCgwIxrnIpQYQ2OGGjwI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1689394374,
            "review_datetime_utc": "07/15/2023 04:12:54",
            "review_text": "They kicked us out early and we're very rude about everything. They threatened us with police and they breached the contract"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKa3FDRmx3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKa3FDRmx3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJkqCFlwE%7CCgwIibfBpQYQ2LnPhgM%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1689279369,
            "review_datetime_utc": "07/13/2023 20:16:09",
            "review_text": "Had a lot of fun and the food was good.I will go again."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKdU9LdXZ3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKdU9LdXZ3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJuOKuvwE%7CCgwIqb2wpQYQuLC5gwE%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1689001641,
            "review_datetime_utc": "07/10/2023 15:07:21",
            "review_text": "The atmosphere is good but unfortunately the food fell flat. The Philly egg rolls were soooo greasy and not at all balanced or tasty. The wings lacked flavor, the ribs were a little tough, the fish taco was boring, the. The pork belly was the best thing we got hands down. All in all, we will not be back."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKeUtEU05REAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKeUtEU05REAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJyKDSNQ%7CCgsI8ZKspQYQ6I-vJw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1688930673,
            "review_datetime_utc": "07/09/2023 19:24:33",
            "review_text": "Ordered take out and got handed the wrong order. Not only that, our actual order cost more than double what they gave us."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKaU1fMUZ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKaU1fMUZ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJiM_1Fw%7CCgwIwo2spQYQgMGxnQE%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1688929986,
            "review_datetime_utc": "07/09/2023 19:13:06",
            "review_text": "Was very disappointed from the start, first there was nowhere the park, we had to find our own table and unfortunately the only table we could find was one under the A/C unit which was dropping condensation on our table. The food was not what we expected nor was the drinks . Over-all I can't give this place a Thumbs up"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKc0lhT1VnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKc0lhT1VnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJsIaOUg%7CCgwIxryqpQYQ6KO-gQE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688903238,
            "review_datetime_utc": "07/09/2023 11:47:18",
            "review_text": "Great food"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURKNE9yeXV3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURKNE9yeXV3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJ4OryuwE%7CCgwI29qnpQYQiOrxvAI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1688857947,
            "review_datetime_utc": "07/08/2023 23:12:27",
            "review_text": "I understand why the ratings are so unenthusiastic after visiting - food wasn't great, beer was expensive, not a very interesting or fun vibe.  Will not be back."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURKd1BhcGVREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURKd1BhcGVREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDJwPapeQ%7CCgsI_aqmpQYQsP-1Fg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688835453,
            "review_datetime_utc": "07/08/2023 16:57:33",
            "review_text": "Delicious  highly recommend"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKaC16SlRnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKaC16SlRnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJh-zJTg%7CCgwI68WYpQYQ-KLT4QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688609515,
            "review_datetime_utc": "07/06/2023 02:11:55",
            "review_text": "Love this place! Had a great atmosphere. The group had fun and the employee Eddie made the experience more enjoyable! Food was good too!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdTk2bXhRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNKdTk2bXhRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJu96mxQE%7CCgwI-PyWpQYQ0Iu09wE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688583800,
            "review_datetime_utc": "07/05/2023 19:03:20",
            "review_text": "Seoul Meat Company has the best karaoke in Charlotte. The rooms are spacious and well-equipped, and the staff is friendly and helpful. I had a blast singing my heart out with my friends, and I would definitely recommend this place to anyone looking for a great karaoke experience."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKbTYyU0hBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKbTYyU0hBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJm62SHA%7CCgwI0-mVpQYQ6Jib-gI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1688564947,
            "review_datetime_utc": "07/05/2023 13:49:07",
            "review_text": "Nice setup and atmosphere. Friendly and helpful staff, in front and patio area. Validating the parking was nice.\n\nNow for the food. The philly egg rolls were not fully cooked and was nothing but meat and cheese. Why mustard sauce accompaniment?\nWings were gigantic! Soy garlic was mostly soy flavored, maybe add some minced garlic. The crunch was on point though. The sweet and mild was HEAVY on the siracha. YUCK! Siracha and sweet was a no buena for me. The best thing we ordered was the brisket bulgogi taco. It was borderline salty but compared to the other food, we dealt with it.\nOverall, the experience was subpar and I wound up at Captain D's for a piece of fish because I was still hungry after that $40 disappointment. I don't think I will be back but I appreciate the effort.\nI wish you some improvement and success."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKeV9TUkpnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKeV9TUkpnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJy_SRJg%7CCgsIoMmSpQYQsKTYTA%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1688511648,
            "review_datetime_utc": "07/04/2023 23:00:48",
            "review_text": "Service was not that great and the atmosphere is amazing! But the food was awful! It gave me and my friends diarrhea and some of them were vomiting all night long!  I don't write reviews but I had to because I was in total shock of the food!  It was a disgrace to Korean food because Korean food is amazing but this place was just not it!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdzlUSXBRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNKdzlUSXBRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJw9TIpQE%7CCgsIvq2MpQYQ8KjvLw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688409790,
            "review_datetime_utc": "07/03/2023 18:43:10",
            "review_text": "The best wings in Charlotte!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKM1k3dlpREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKM1k3dlpREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJ3Y7vZQ%7CCgwI6eqJpQYQoJaEygM%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1688368489,
            "review_datetime_utc": "07/03/2023 07:14:49",
            "review_text": "Four stars because the drinks are overpriced for my soberness, but the food are definitely worth it. Pork belly if you want to treat yourself to something really good. You can also get the Ramen Mac n' cheese because my friend absolutely loves it. I don't like Mac n' cheese so im not impressed, but this is my friend's go-to food when she's drunk."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKdGJHaVRREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKdGJHaVRREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJtbGiTQ%7CCgsIoMaDpQYQ6PTpQA%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688265504,
            "review_datetime_utc": "07/02/2023 02:38:24",
            "review_text": "I've been looking for that exact food fusion all my life, i will have to try everything on the menu"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKdGFxdC13RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNKdGFxdC13RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJtaqt-wE%7CCgwIt6SDpQYQ2IumgwE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1688261175,
            "review_datetime_utc": "07/02/2023 01:26:15",
            "review_text": "First off, the wings are super flavorful. I got the sweet and mild wings and they were very good but emphasis on the sweet so if you don't like sweet stuff I wouldn't get that. I also got a beef brisket taco which was also very good and had a sweet taste as well. I will say, the food was good and the service was fast, but the food came out room temperature. If it was hot this would definitely be a 4.5 out of 5"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbkpTcDJ3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNKbkpTcDJ3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJnJSp2wE%7CCgwIldD8pAYQ4NKRuAM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688152085,
            "review_datetime_utc": "06/30/2023 19:08:05",
            "review_text": "Yalllllllll this food was so good I didn't even get to take a picture before we started crushing it! We ordered soy pork spare ribs, fat brisket bulgogi taco, soy garlic wings, and kimchi fries. Every single thing we ordered was hot, full of flavor, crispy, and just absolutely amazing! We will definitely be back to eat and for karaoke. We also plan to go to the newer location.\n\nUpdate: We visited again and had an even better experience, which I didn't think was possibly. We rented the karaoke room which is a MUST DO! Our server was amazing, I'm disappointed I can't remember his name but he had dreads."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKeWI2enB3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNKeWI2enB3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJyb6zpwE%7CCgwIlcL4pAYQsJbl3wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1688084757,
            "review_datetime_utc": "06/30/2023 00:25:57",
            "review_text": "It was a nice place overall for the family especially. I love my fur babies and it was the perfect atmosphere for fun drinks food and the joy of having your kiddos and or pets with you without all the dirty looks! It was a nice environment good people and great food!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKc2JLM093EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKc2JLM093EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJsbK3Ow%7CCgwIyf71pAYQ4IKN4QI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1688043337,
            "review_datetime_utc": "06/29/2023 12:55:37",
            "review_text": "It's been a while since I've been here. I definitely think the food could be better. It did not taste how it was previous times I've visited. I was kind of disappointed . I do recommend trying the potato swirl ."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNKOHA3Y0h3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNKOHA3Y0h3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJ8p7cHw%7CCgwI-PHbpAYQsJKz_gI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1687615736,
            "review_datetime_utc": "06/24/2023 14:08:56",
            "review_text": "Great location, the food is really good. I didn't care for the drink I had, It tasted like a melted ice pop. The karaoke rooms are fun, but they need more of a song selection and easier way to select songs. Overall, I would recommend we had a great time."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNKbE5HWnBBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNKbE5HWnBBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICJlNGZpAE%7CCgwItIHMpAYQ4O3X9AI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1687355572,
            "review_datetime_utc": "06/21/2023 13:52:52",
            "review_text": "Great service and they refuse taking tips"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNBaWViOFBREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNBaWViOFBREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICAieb8PQ%7CCgwIo-iupAYQ0MKZ7AE%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1686877219,
            "review_datetime_utc": "06/16/2023 01:00:19",
            "review_text": "Shame place has gone down in quality since it opened. We were given really old kimchi, our wings were small and not as tasteful as it used to be, and somehow our fried potato swirl was soggy? Can't recommend coming here anymore, and the parking situation just isn't worth it."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dTY2Z1VREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR4dTY2Z1VREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDxu66gUQ%7CCgwIubGtpAYQ0PW72wE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1686853817,
            "review_datetime_utc": "06/15/2023 18:30:17",
            "review_text": "Amazing wings and atmosphere"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4MWZHWllnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR4MWZHWllnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDx1fGZYg%7CCgwI48ydpAYQ6JaZ7QI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1686595171,
            "review_datetime_utc": "06/12/2023 18:39:31",
            "review_text": "Despite having a k-pop themed karaoke room, there were no k-pop songs and they even told us their system is outdated. Also, charging more for different themed rooms when every room has the same songs is a bit ridiculous. It's just different wallpaper and different sizes."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4LWRERWN3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR4LWRERWN3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDx-dDEcw%7CCgwI-ZWYpAYQ-OeXmgI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1686506233,
            "review_datetime_utc": "06/11/2023 17:57:13",
            "review_text": "This was the most confusing restaurant I've ever been to. It's a seat-yourself, order at the bar place. The front counter says to find a seat and then you can order online to pick up food from the pick up area (but then it will be in to go boxes). You have to talk to the bartender if you want to order food or drinks, then you get a buzzer when it's ready to grab.\n\nThe menu is extremely nondescript, just a list of the items with no idea what they are - and the prices were all completely wrong. Some things were listed for a little above what they actually were and some were listed for a little under what they came out to be.\n\nThey do give wet naps and food gloves which was nice, but the food didn't really have much excitement. I would recommend the owner redesign a lot of how the restaurant functions."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURzNGQtZS1BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURzNGQtZS1BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDs4d-e-AE%7CCgwI27-UpAYQsICSiwM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1686446043,
            "review_datetime_utc": "06/11/2023 01:14:03",
            "review_text": "2023 update: they are still serving undercooked meat\n\nOriginal review: Had 10 wings and kimchi fries there last night. Both me and my date got food poisoning. Trying not to die atm."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4eWEyeS1RRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR4eWEyeS1RRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDxya2y-QE%7CCgwIqvuTpAYQ4OO1uAM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1686437290,
            "review_datetime_utc": "06/10/2023 22:48:10",
            "review_text": "What happened to this place? I had not been in a while and visited today. The food used to be really good and it is not anymore. Quality has gone way down. They also no longer have servers and you are forced to order drinks and food at the bar with only one person taking orders and making drinks. I gave it two stars only because the soy garlic wings were decent even though they're half the size they used to be. I'm out on this place unfortunately."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4bXRHVXp3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR4bXRHVXp3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDxmtGUzwE%7CCgwIzqH8owYQoJKvzQI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1686048974,
            "review_datetime_utc": "06/06/2023 10:56:14",
            "review_text": "Pineapple soju was so good. Food was just average; the Karaoke looked fun."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4a3B6ZG9BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR4a3B6ZG9BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDxkpzdoAE%7CCgsIhKb1owYQiN3jVg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1685934852,
            "review_datetime_utc": "06/05/2023 03:14:12",
            "review_text": "Great experience. They helped me out with parking too how to navigate the Parking App. The chicken wings were a must try and the karaoke a great time."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4NHRIMXBBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR4NHRIMXBBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDx4tH1pAE%7CCgsI5870owYQsISnUg%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1685923687,
            "review_datetime_utc": "06/05/2023 00:08:07",
            "review_text": "Not my kind of place, primarily if I am heading out for dinner I want to be waited on. Also no one told us how the \"place worked\". Everyone likes the food, but..."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4N0pfN2dnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR4N0pfN2dnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDx7J_7ggE%7CCgwI2tntowYQiIKMiwE%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1685810394,
            "review_datetime_utc": "06/03/2023 16:39:54",
            "review_text": "Hated it!"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUR4dElYZUxnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUR4dElYZUxnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDxtIXeLg%7CCgwIh_joowYQiN3EigE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1685732359,
            "review_datetime_utc": "06/02/2023 18:59:19",
            "review_text": "We went there last night on June 1st, ate chicken wings and crispy pork belly. While we were eating, noticed roaches running around the dining area and in the check in counter. If there are roaches in the dining area, I can only assume there are more in the kitchen. The food was not anything to note, but we will not be planning on dining here again due to the unsanitary conditions."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUR4aE9XeW5BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUR4aE9XeW5BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDxhOWynAE%7CCgwI7NHjowYQkPPOywI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1685645548,
            "review_datetime_utc": "06/01/2023 18:52:28",
            "review_text": "It's a great place to go if you like karaoke and good chicken wings."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4X19taGFBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4X19taGFBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICx__mhaA%7CCgwI_53VowYQ6LuwgwE%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1685409535,
            "review_datetime_utc": "05/30/2023 01:18:55",
            "review_text": "The most racist place I've ever been. I thought this was 2023. Sad. Horrible place horrible ppl. Save your money."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4djduMFVREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4djduMFVREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxv7n0UQ%7CCgwItInUowYQiMjXhgE%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1685390516,
            "review_datetime_utc": "05/29/2023 20:01:56",
            "review_text": "Tasty. Good quality food."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4djhLSFZ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4djhLSFZ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxv8KHVw%7CCgwIufjTowYQ6Ka-zgM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1685388345,
            "review_datetime_utc": "05/29/2023 19:25:45",
            "review_text": "Amazing food. There sweet and spicy wings are to die for. I love their sweet potato bird nest and their ribs are really good too. I loved their kimchi pork egg rolls. The deviled eggs are a favorite of my husband's. My boys like the bao buns and the pulled pork. I don't know if I've tried anything I don't like!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4el9TM2lRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN4el9TM2lRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxz_S3iQE%7CCgwI7O7PowYQoIGu7gE%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1685321580,
            "review_datetime_utc": "05/29/2023 00:53:00",
            "review_text": "5 star food, 1 star service"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4dThXRE1REAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4dThXRE1REAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxu8WDMQ%7CCgwIhvbFowYQ4KfO5gE%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1685158662,
            "review_datetime_utc": "05/27/2023 03:37:42",
            "review_text": "Def would recommend, it was so fun and everything was so delicious, it was fast and efficient. I we'll be going back."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4bTZfYkJ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4bTZfYkJ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxm6_bBw%7CCgwI1PnDowYQkOru6wI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1685126356,
            "review_datetime_utc": "05/26/2023 18:39:16",
            "review_text": "Try the Philly Cheese Egg Rolls!!!!! Great after club spot. Pretty chill vibe."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4czR5WFZREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4czR5WFZREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxs4yXVQ%7CCgwIm969owYQ6Laa9wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1685024539,
            "review_datetime_utc": "05/25/2023 14:22:19",
            "review_text": "Great Korean fusion options!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4eWZ2Y293RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN4eWZ2Y293RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxyfvcowE%7CCgsIidSjowYQwPb7Mg%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1684597257,
            "review_datetime_utc": "05/20/2023 15:40:57",
            "review_text": "BE CAREFUL WHERE YOU PARK! Predatory towing company's (SI Recovery) take your car even if you paid for parking in THEIR parking lot. Seoul needs to do better in providing established parking for their clients. Paying 335 to recover a car and the food was mid at best."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4OGZEUVRnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4OGZEUVRnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICx8fDQTg%7CCgwI85ChowYQwI-x3gI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1684555891,
            "review_datetime_utc": "05/20/2023 04:11:31",
            "review_text": "Pretty interesting concept. It is not your traditional Korean restaurant and the menu is adapted to the American taste with a diverse fusion of different culinary dishes using Korean dishes. We tried the chicken kimchi fries, the deviled eggs and a couple different tacos. Food was amazing .\nThey have a good bar with multiple beers available and plenty of room to seat ."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4X3BHaXp3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN4X3BHaXp3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICx_pGizwE%7CCgwIrPGZowYQoNKnkQI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1684437164,
            "review_datetime_utc": "05/18/2023 19:12:44",
            "review_text": "Great spot to hang out with friends on the weekend! I love the outdoor games and bar area. The karaoke rooms are great for a birthday celebration! My favorite dishes are the bulgogi beef tacos, soy pickled deviled eggs, and ramen mac and cheese."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4NXEtTkZnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4NXEtTkZnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICx5q-NFg%7CCgsIwbePowYQkPekJw%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1684265921,
            "review_datetime_utc": "05/16/2023 19:38:41",
            "review_text": "1 word ..wings "
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUN4ek42T2NREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUN4ek42T2NREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxzN6OcQ%7CCgwI3a33ogYQ-J_-0AM%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1683871453,
            "review_datetime_utc": "05/12/2023 06:04:13",
            "review_text": "Came here on vacation but I don't think I would come here again if I lived in the area. A Korean BBQ infused with American bbq may sound like an interesting idea in theory. However, this ain't it.\n\nOne big takeaway I had is if you have a sign on the door saying this is not a typical Korean BBQ restaurant, at least put some descriptions on the menu explaining what is in each dish. The menu is not helpful at all.\n\nFood was decent but the place gave us a vibe of you should already know what our menu is and where to order. Like it only wants regular customers and gives newcomers a cold shoulder."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4akluV3ZnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN4akluV3ZnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICxjInWvgE%7CCgsI26n2ogYQ4OD_fA%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1683854555,
            "review_datetime_utc": "05/12/2023 01:22:35",
            "review_text": "Food way okay. Nobody talked to us unless we went up to them. They wouldn't change the channel for us to watch the NFL network so we could watch the schedule release even though we both work at Bank of America Stadium."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUN4NUlLSjh3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUN4NUlLSjh3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICx5IKJ8wE%7CCgwIkLLxogYQiO_toQI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1683773712,
            "review_datetime_utc": "05/11/2023 02:55:12",
            "review_text": "Decent food. Great place to go for getting a drink for some Asian inspired food. More of a pub atmosphere. However too expensive for the inconsistent quality.  Some dishes were quite tasty but others are terrible for the price.\n\nThe Terrible:\n-Chojang Broccoli Salad: charged way too much for literally steamed broccoli with sweetened gochujang sauce.\n- Kim-chili Ramen mac: noodles too bloated. Mac and cheese flavor isn't great.\n-Kim Bap: rice was really soggy. Only 5 pieces for $8!\n\nThe good ones:\n- Beef rib is decent. Falling off bone tender. Got a nice smoke flavor to it. But only thing \"Asian\" about it is the soy sauce dipping sauce.\n- Kim Chi Fries: can't go wrong with fries, kimchi, meat, and cheese.\n- BAF wings: good flavors. Wing is tender. Good with beer. Not the crunchy type coating but still tasty.\n\nOkay ones:\n- Potato Swirl: looks pretty. A bit too thin and over fried for my personal preference\n-"
        },
        {
            "review_id": "ChRDSUhNMG9nS0VJQ0FnSUM4MzljWhAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChRDSUhNMG9nS0VJQ0FnSUM4MzljWhAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIC839cZ%7CCgsI7a7gogYQ-ICrCQ%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1683494765,
            "review_datetime_utc": "05/07/2023 21:26:05",
            "review_text": "\"Two years later, I came back... The Yuzu cocktail I love is now $18... Sad... Learned the reason the bartender from two years ago gave me so much trouble was because management charges the bartenders for miss orders and over pouring... More sad... Management bad\"\n\nDon't order mix drinks from here, if they accidentally use soda water instead of sprite and you request another one they will tell you \"We are all trained to make drinks the same way, we can get you another drink but you will be changed for it\". So yea they messed up my Yuzu drink and told me they didn't mess it up and they would not make me another one."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSbl9LSmFREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURSbl9LSmFREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDRn_KJaQ%7CCgwI2-3cogYQoKrGlgM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1683437275,
            "review_datetime_utc": "05/07/2023 05:27:55",
            "review_text": "Did karaoke with friends and it was great! Every room was packed and the song selection was never ending.  The staff was fun and friendly and willing to help when needed, so that was nice!\n\nDrinks are pricy but that's because they don't tips and the price is added directly with I like. So bring plenty of cash or be ready for the bill if you are buying or like to party.\n\nGood is amazing and the chicken wings are great."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSMGUzUV9nRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURSMGUzUV9nRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDR0e3Q_gE%7CCgsI44qqogYQsMTbAg%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1682605411,
            "review_datetime_utc": "04/27/2023 14:23:31",
            "review_text": "One of my favorite restaurants in Charlotte simply because of the Korean Chicken Wings! I wish they still did the $1 side days because some (most) of the sides aren't worth the money they charge. The side that is worth it is the Kimchi fries, even with the price increases, which we get every time. Cool, relaxing vibe and the outside area is sweet as well!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSeHY3Y3FRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURSeHY3Y3FRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDRxv7cqQE%7CCgwI1N6XogYQiK264wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1682304852,
            "review_datetime_utc": "04/24/2023 02:54:12",
            "review_text": "It's really a cool place to hang out. I enjoy myself. I want to go there again"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURSZ3J6Y1RnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURSZ3J6Y1RnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDRgrzcTg%7CCgwI6o6GogYQuIb96wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1682016106,
            "review_datetime_utc": "04/20/2023 18:41:46",
            "review_text": "You can rent private karaoke rooms at this place. A friend booked one for us and we had dinner. Karaoke selection was decent. The food was definitely good. Loved the tacos. I tried the \"no refund spicy\" tofu and it was legitimately spicy. If you like spicy food, you'll love it."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSN0lEOG9BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURSN0lEOG9BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDR7ID8oAE%7CCgwIy-mAogYQgOGVgQM%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1681929419,
            "review_datetime_utc": "04/19/2023 18:36:59",
            "review_text": "The portions are small, unlike the Korean restaurant I visited in South Africa. The place does not have the oriental Korean culture. See pictures from a Korean restaurant in South Africa."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc0t2TXZBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURSc0t2TXZBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDRsKvMvAE%7CCgwI2rPtoQYQwKHM0wI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1681611226,
            "review_datetime_utc": "04/16/2023 02:13:46",
            "review_text": "Delicious and the bartender  as well as line staff that were bussing the tables were amazing."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSURSc0t6TXBRRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSURSc0t6TXBRRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDRsKzMpQE%7CCgwI-sfsoQYQkNzKvgM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1681597434,
            "review_datetime_utc": "04/15/2023 22:23:54",
            "review_text": "Very nice servers... food was delicious,  fast service, had so much fun in karaoke room. Would definitely visit again when I go back to Charlotte"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSZzZTclJnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNSZzZTclJnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRg6SrRg%7CCgwIn6HJoQYQ2Mq9mwI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1681019039,
            "review_datetime_utc": "04/09/2023 05:43:59",
            "review_text": "Disappointing.\nThe bathroom was out of toilet paper and soap.\nThe chairs are very uncomfortable, especially if you're a bigger person. You are told to pick your own seat and when you're ready to order you have to go to the bar to order, which when we there had a very long line of people ordering drinks and food. The food was eh.\nWe ordered wings, baked ram and cheese, chicken tacos, pork tacos, and the green tea ice cream biscuits (adding up to $60). The wings were good (and big) but they were too salty. The ram and cheese was flavorless and had a gritty uncooked flour feel. The pork and chicken tacos were also lacking flavor. the green tea ice cream had a very subtle flavor and was not sweet at all which paired nicely with the sugar coated biscuits it's served in.\nOverall, the food was disappointing and i would not go back."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSemVHc213RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSemVHc213RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRzeGsmwE%7CCgsIiK_CoQYQ8NTrYw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1680906120,
            "review_datetime_utc": "04/07/2023 22:22:00",
            "review_text": "Would not ammend  taco, which they put too much cream on it, which made it inedible for my wife. I asked them to leave it off, and they said they do not modify orders, I spoke with MOD, and he said it was owners that made policy. If you have any food allergies like we did don't come here.  They would not refund the $7 , so food went in trash"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSOWJpX2JBEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNSOWJpX2JBEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICR9bi_bA%7CCgwIwK3AoQYQgO2ZqwI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1680873152,
            "review_datetime_utc": "04/07/2023 13:12:32",
            "review_text": "Love this place got the giant rib and it stood up to it's name!! Very good indeed and the bar atmosphere is really nice only downfall is that it's pretty cold sit by the exits I recommend they winterize the seating area to keep drafts from coming in.."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSLWVxa3hBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSLWVxa3hBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICR-eqkxAE%7CCgwI2uW4oQYQuJfO3QI%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1680749274,
            "review_datetime_utc": "04/06/2023 02:47:54",
            "review_text": "The brisket was incredible. Easily rivaled any southern BBQ brisket I've ever had. The beef fries were amazing and would be a delicious whole meal by themselves. The pimento cheese was super tasty too and the beer selection was decent enough to be happy with. Overall the whole food/bev experience was top notch! Would love to go back but I'm not a local unfortunately! Highly recommended."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSb2NxMENnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNSb2NxMENnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRocq0Cg%7CCgwI3qusoQYQ2ObrzgI%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1680545246,
            "review_datetime_utc": "04/03/2023 18:07:26",
            "review_text": "Good food, temp on burner was off and burnt some food. Kind of annoying. Great service and unlimited food helped."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScnVDSHl3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNScnVDSHl3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRruCHywE%7CCgwImL-koQYQ8LKnrwM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1680416664,
            "review_datetime_utc": "04/02/2023 06:24:24",
            "review_text": "THEY DON'T CARE ABOUT YOU !! they don't care about customer satisfaction they just want your money."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNScW9qbWJ3EAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNScW9qbWJ3EAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRqojmbw%7CCgsItPCToQYQkJiMfw%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1680144436,
            "review_datetime_utc": "03/30/2023 02:47:16",
            "review_text": "As a business owner who cares about people, their customers and community...it saddens me to say Seoul Food DOES NOT CARE!\n\nTwo people got their cars towed during the weekday. Yes, after the fact, we saw signs but clearly they are not doing a good enough job at notifying their customers about this. They need to have each employee trained to really inform everyone verbally because it's easy to miss signs when your coming in after a long day of hard work to spend time with friends, eat food and enjoy yourself. They last thing anyone wants to do is look at signs, marketing material or whatever posted on walls. Those two people who had to spend almost $400 to get there cars back are honest people and not looking for trouble yet we can't control it according to Andrew the manager.\n\nAs a business...who sells their lot unless they are just there to take the communities money, don't care, or have some other internal problems that they need the money to do so. Perhaps the articles read elsewhere were right, things like the place isn't what it used to be, going downhill, etc.\n\nWe also spent a lot of money since there food prices are astronomically high. The place was dirty and things were broke in the karaoke room and bathroom. The customer service was cold and non existent. The employees were on their phones and we bad to call for them when we needed something. The owners don't seem to care at all because it seems that they must think that since they are in Southend that all is going to be ok due to shear numbers.\n\nWell it will STOP now, I hope everyone can see this review and know that you should spend your hard earned money in a classier establishment. One that actually cares about you, the community and what their reputation stands for."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNScXFEbzZnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNScXFEbzZnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRqqDo6gE%7CCgwIxOeToQYQoODgsQM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1680143300,
            "review_datetime_utc": "03/30/2023 02:28:20",
            "review_text": "Terrible place, the food was average to BAD, place was dirty feeling and no warm vibes from staff at all. Food was very over priced and they should just get out of Southend because they are to old and CLEARLY don't care anymore about the community or their customers. No wonder they have been in articles and magazines saying bad things and how the company is going down at this location. Just don't waste your time, let them leave and then we can get a classier better caring business in there who cares about the community."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSeXNmNmh3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSeXNmNmh3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRysf6hwE%7CCgwIytCToQYQ8KHalQI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1680140362,
            "review_datetime_utc": "03/30/2023 01:39:22",
            "review_text": "I would NOT recommend for several reasons. We as a group decide to go here on a Wednesday night to do Karaoke and food. The room was dirty, microphones didn't work, books dirty and room smelled. The food was average at best, the service was fine but slow.\n\nOh and they DONT own their lot...so my car got towed and cost me $300 dollars. So forget this place unless you want to be nickeled and dimed for average food, average atmosphere, and if you want your car towed!\n\nAlso you can't even tip your server or bartender unless it's cash...seems a little to sketchy for me to ever go back. Andrew was the manager/owner/ who ever working this night. He just said sorry and no help."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSdlBmY2lnRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSdlBmY2lnRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRvPfcigE%7CCgsI3OyIoQYQ2IunWQ%7C?hl=en",
            "review_rating": 4,
            "review_timestamp": 1679963740,
            "review_datetime_utc": "03/28/2023 00:35:40",
            "review_text": "American Korean mix restaurant, not really down to earth but the atmosphere is good. Highly recommend pork belly."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNXekpTRnF3RRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNXekpTRnF3RRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICWzJSFqwE%7CCgwIxZqHoQYQuPzVigI%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1679936837,
            "review_datetime_utc": "03/27/2023 17:07:17",
            "review_text": "This place has really gone down hill. The prices have doubled over the past year or so, and that's not inflation, it's price gouging. Meanwhile the service has become non-existent. It used to be great but now I wouldn't bother"
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSUNSek5Uck1REAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSUNSek5Uck1REAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRzNTrMQ%7CCgwI0YWDoQYQoOXZlwM%7C?hl=en",
            "review_rating": 5,
            "review_timestamp": 1679868625,
            "review_datetime_utc": "03/26/2023 22:10:25",
            "review_text": "Where to start? Such a great place to bring kids and meetup in a large group. Great service from Carly and team. Food was next level...coming from a foodie. Overall fantastic experience!"
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSak1lQmlBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSak1lQmlBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRjMeBiAE%7CCgwIidmCoQYQ2PzSwwM%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1679862921,
            "review_datetime_utc": "03/26/2023 20:35:21",
            "review_text": "The food is not good."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSakszcDJBRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSakszcDJBRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICRjK3p2AE%7CCgwIwMCCoQYQqKCAlwM%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1679859776,
            "review_datetime_utc": "03/26/2023 19:42:56",
            "review_text": "Hate to give this place 3 stars. Seoul used to be good. We used to come here frequently and even did karaoke a few times. Came back yesterday and was disappointed not only by the food, but by the service.\nFood: The soy garlic wings are a usual go to, but they were not as crispy or tasty yesterday. Also ordered the pork kimchi taco which was room temperature heat. The bulgogi kimbap was just okay too.\nService: when we ordered at the front bar, the lady was rude. We had a question about substitutions and her response was curt. When I went to close my tab there was an addition $40+ dollars on my tab of food I didn't order. They said it was because another person had a similar last name and the food ended up on my tab. Really should be more careful about that.\nI want to say I would come back, but if the level of service continues to be rude and nonchalant to customers probably not. It shows because they weren't as crowded as other bars on a nice day in South End. Hope management can get this place back on track."
        },
        {
            "review_id": "ChdDSUhNMG9nS0VJQ0FnSUNSNU8zX19BRRAB",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChdDSUhNMG9nS0VJQ0FnSUNSNU8zX19BRRAB!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgICR5O3__AE%7CCgwItLL9oAYQgKGH8QI%7C?hl=en",
            "review_rating": 3,
            "review_timestamp": 1679776052,
            "review_datetime_utc": "03/25/2023 20:27:32",
            "review_text": "Good spot for karaoke. We enjoyed the private room, but the food was overpriced and not good. They also charge $20 non-refundable just to book a karaoke room."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoN0lHVkJnEAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURoN0lHVkJnEAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDh7IGVBg%7CCgwIofj2oAYQ0OzizAI%7C?hl=en",
            "review_rating": 1,
            "review_timestamp": 1679670305,
            "review_datetime_utc": "03/24/2023 15:05:05",
            "review_text": "Bad management run by entitled millennials who think cops solve all their problems."
        },
        {
            "review_id": "ChZDSUhNMG9nS0VJQ0FnSURoLTZuOGNREAE",
            "review_link": "https://www.google.com/maps/reviews/data=!4m8!14m7!1m6!2m5!1sChZDSUhNMG9nS0VJQ0FnSURoLTZuOGNREAE!2m1!1s0x0:0x286877278777ef79!3m1!1s2@1:CIHM0ogKEICAgIDh-6n8cQ%7CCgsIlMvZoAYQsKONcw%7C?hl=en",
            "review_rating": 2,
            "review_timestamp": 1679189396,
            "review_datetime_utc": "03/19/2023 01:29:56",
            "review_text": "This experience was not a pleasant one. Two of us ordered 6 wings, sweet and mild flavor. One patron's wing came out cold and she switched for a taco instead. I attempted to eat my wings, but they were covered in sauce and heavily breaded. I informed the waitress that I am unable to eat these due to the amount of sauce and requested to switch to another flavor, which several others were eating and indicated they were decent. They did not have a ton of sauce on them. She told me I could not switch and if I did, I would have to pay for the old and new order of wings. My friends asked what the difference was with the other switched order. She indicated that \"something has to be wrong. My order is not wrong, I just don't like them.\"  I was forced to pay $14 for food I did not eat.I confirmed with another employee and he said they asked the manager and that was his response. What's interesting is I received the answer from her without speaking to the manager. Never will this restaurant get my business again."
        }
    ]
}